/*******************************************************************************
 * 模块名      : TiVidDrv
 * 文件名      : I2C.h
 * 相关文件    : I2C.c
 * 文件实现功能: I2C 驱动接口
 * 作者        : 钮月忠㊣
 * 版本        : V1.0 Copyright(C) 1995-2006 KEDACOM, All rights reserved.
 * -----------------------------------------------------------------------------
 * 修改记录:
 * 日  期       版本        修改人      修改内容
 * 2006/05/21   1.0a        钮月忠      创建	
*******************************************************************************/
#ifndef I2C_H  
#define I2C_H 1

enum
{
    I2C_OK = 0,
    I2C_INV_PARAM,
    I2C_OPEN_FAILED
};

/*==============================================================================
    函数名      : I2CWrite
    功能        ：发送 I2C 数据
    算法实现    ：略
    引用全局变量：无
    输入参数说明：无
    返回值说明  ：无
==============================================================================*/
s32 I2CWrite(u8 byDevAddr, u8 bySubAddr, u8 byData);

/*==============================================================================
    函数名      : I2CRead
    功能        ：接收 I2C 数据
    算法实现    ：略
    引用全局变量：无
    输入参数说明：无
    返回值说明  ：无
==============================================================================*/
s32 I2CRead(u8 byDevAddr, u8 bySubAddr, u8 *pbyData);

#endif /*#ifndef I2C_H*/
