/*****************************************************************************
Ä£¿éÃû      : MCA
ÎÄ¼şÃû      : mca_lib.h
Ïà¹ØÎÄ¼ş    : 
ÎÄ¼şÊµÏÖ¹¦ÄÜ: mca lib head file
×÷Õß        : Allen Wang
°æ±¾        : V1.0  Copyright(C) 1995-2012 KEDACOM, All rights reserved.
-----------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼:
ÈÕ  ÆÚ      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
3/16/2012  01.0         	Allen Wang	Creat	
3/23/2012  01.1         	Allen Wang	ĞŞ¸ÄÃüÃû¹æ·¶
4/17/2010  01.2 		Allen Wang      ĞŞ¸ÄÏàÓ¦ÊµÏÖ¼°×¢ÊÍ
******************************************************************************/

#ifndef __MCA_LIB_
#define __MCA_LIB_

#ifdef __cplusplus
extern "C" {
#endif


#include <stdlib.h>
#include "kdvtype.h"

#define MCA_MAX_CHIP_NUM				10		/*ÏµÍ³Ö§³ÖµÄ×î´óµÄĞ¾Æ¬ÊıÄ¿*/
#define MCA_DATA_BUFF_MAX_NUM			100		/*Êı¾İBUFF×î´ó¸öÊı*/
#define MCA_CMD_BUFF_MAX_NUM			32		/*ĞÅÁîBUFF×î´ó¸öÊı*/

#define MCA_DATA_BUF_VAILD				1		/*ÏµÍ³Ê¹ÄÜÊı¾İBUFF´«Êä*/
#define MCA_DATA_BUF_INVAILD			0		/*ÏµÍ³²»Ê¹ÄÜÊı¾İBUFF´«Êä*/


#define MCA_RCV_DABUF_FROM_USER		1		/*Êı¾İBUFFÓÉÓÃ»§Ìá¹©*/
#define MCA_RCV_DABUF_FROM_MCA		0		/*Êı¾İBUFFÓÉMCAÌá¹©*/

#define MCA_INIT_RESTART_STRA			1		/*¸´Î»²ßÂÔ£¬Èç¹ûÓĞÒ»¸öĞ¾Æ¬Î´³É¹¦Æô¶¯£¬Ôò¸´Î»Õû¸öÏµÍ³*/
#define MCA_INIT_NORMAL_STRA			0		/*ÆÕÍ¨²ßÂÔ*/

#define MCA_MSG_DESC_VAILD				0x5a5a5a5a


#define MCA_CHIP_DM8168					1
#define MCA_CHIP_MPC8377				2
#define MCA_CHIP_P2020					3
#define MCA_CHIP_C6678					4


#define ERR_MCAINIT						-233		/*MCA³õÊ¼»¯´íÎó*/
#define ERR_MCA_MSG_PEER_FULL			-234		/*¶Ô¶ËbuffÂú*/
#define ERR_MCA_MSG_CHANNEL_BUSY		-235		/*ÏûÏ¢Í¨µÀÃ¦*/
#define ERR_MCA_MSG_NO_MSG			-236		/*Ã»ÓĞĞÅÏ¢¿É¶Á*/
#define ERR_MCA_NO_MORE_DATABUF		-238		/*Ã»ÓĞbuff¿É¶Á*/
#define ERR_MCA_ERR_PARM				-239		/*²ÎÊı´íÎó*/
#define ERR_MCA_ERR_CALL				-240		/*´íÎóµÄµ÷ÓÃ¡¢Çë²ÎÕÕAPIËµÃ÷*/
#define ERR_MCA_ERR_DMA_TRANS			-241		/*dma´«Êä´íÎó*/
#define ERR_MCA_ERR_CACHE_FLUSH			-242		/*dma´«Êä´íÎó*/
#define ERR_MCA_ERR_EDMA_2DFILL			-243		/*dma´«Êä´íÎó*/


/*dma´«ÊäË¢cache·½Ê½*/
#define 	SRC_NONFLUSH_DST_NONCOHERENT 0
#define 	SRC_FLUSH_DST_NONCOHERENT	1
#define 	SRC_NONFLUSH_DST_COHERENT	2
#define 	SRC_FLUSH_DST_COHERENT		3



typedef int  HMcaObj;

typedef void ( *TEPPrtFunc )(u32 dwEpid, u8 * pbyPrtBuff);

enum McaBufType
{
	MCA_BUF_CMD =0,
	MCA_BUF_DTA,
};

typedef struct ChipSet
{
	u32 dwType;		/*DM8168,MPC8377,P2020,C6678 etc...*/
	u32 dwIndex;	/*±íÊ¾Í¬ÀàĞÍĞ¾Æ¬µÄË÷Òı*/
	u32 dwChipid;	/*Î¨Ò»µÄchipid*/
} TChipSet;

typedef struct BufferDesc
{
	u32 dwPhysAddr;
	u32 dwVirAddr;
	u32 dwLen;
}TBufferDesc;


typedef struct McaParam
{
	u32 dwDBufVaild;	/*ÊÇ·ñÆôÓÃÂãÊı¾İ´«ËÍ£¬MCA_DATA_BUF_VAILD±íÊ¾ÆôÓÃ*/								
	u32 dwRcvDBufStra;	/*ÓÉÓÃ»§Ìá¹©½ÓÊÕÂãÊı¾İbuffer »¹ÊÇmcaÌá¹©£¬Èç¹ûÓÃ»§Ìá¹©µÄ»°£¬
						±ØĞëÊÇÎïÀíµØÖ·Á¬ĞøµÄbuffer£¬ÇÒ4K¶ÔÆë£¬ ÎªMCA_RCV_DABUF_FROM_USER±íÊ¾ÓÃ»§Ìá¹©*/
	u32 dwRcvDBufNum;	/*ÓÃ»§Ìá¹©µÄbuffer¸öÊı£¬rcv_bufstraÎª1ÓĞĞ§,<10*/
	TBufferDesc	 tRcvBuffer[MCA_DATA_BUFF_MAX_NUM];	/*ÓÃ»§Ìá¹©µÄbuffer £¬ÌîÈëµØÖ·ºÍ³¤¶È*/
	u32 dwMaxCmdSize;	/*ĞÅÁî°üµÄ×î´ó³¤¶È£¬bufferÓÉmcaÌá¹©£¬Îª½ÚÔ¼ÄÚ´æ£¬²»Òª³¬¹ı128K, ´óĞ¡4K¶ÔÆë*/
	u32 dwMaxDataSize;	/*Êı¾İ°üµÄ×î´ó³¤¶È£¬bufferÓÉÓÃ»§»òÕßmcaÌá¹©£¬×î´ó8M*/
	u32 dwCmdBufNum;	/*»º´æµÄĞÅÁî°ü¸öÊı£¬Ä¬ÈÏ32¸ö*/	
	u32 dwInitStra;	/*Èç¹ûÆäÖĞ1¸öEPÃ»ÓĞÆô¶¯³É¹¦£¬
						ÊÇ·ñĞèÒª¸´Î»Õû¸öÏµÍ³£¬MCA_INIT_RESTART_STRA±íÊ¾¸´Î»£¬MCA_INIT_NORMAL_STRA±íÊ¾²»¸´Î»RCÓĞĞ§*/
}TMcaParam;	

typedef struct McaCapability
{
	u32 dwChipid;		/*µ±Ç°Ğ¾Æ¬ID£¬RCÎª0£¬ÆäËûÎªEP£¬¿ÉÄÜ²»Á¬Ğø*/
	u32 dwChipNum;	/*Õû¸öÏµÍ³Ğ¾Æ¬¸öÊı*/	
	TChipSet tMcaChip[MCA_MAX_CHIP_NUM];	/*ÏµÍ³ÖĞµÄ¸÷¸öĞ¾Æ¬*/
}TMcaCapability;


/*====================================================================
    º¯ÊıÃû      : McaGetCapbility
    ¹¦ÄÜ        £º»ñÈ¡mcaÄÜÁ¦¼¯,Ö»ÄÜÔÚopenÖ®ºóµ÷ÓÃ
    ÊäÈë²ÎÊıËµÃ÷£ºcab: Ö¸ÏòÄÜÁ¦¼¯½á¹¹ÌåµÄÖ¸Õë
    ·µ»ØÖµËµÃ÷  £º0£¬»òÕß´íÎóºÅ
---------------------------------------------------------------------*/
s32 McaGetCapbility(HMcaObj * ptObj, TMcaCapability * ptCap);


/*====================================================================
    º¯ÊıÃû      : McaOpen
    ¹¦ÄÜ        £º´ò¿ªmca
    ÊäÈë²ÎÊıËµÃ÷£ºparam:²ÎÊıÖ¸Õë
    ·µ»ØÖµËµÃ÷  £ºHMcaObj Ö¸Õë£¬»òÕßNULL
---------------------------------------------------------------------*/
HMcaObj * McaOpen(TMcaParam * ptParam);


/*====================================================================
    º¯ÊıÃû      : McaClose
    ¹¦ÄÜ        £º¹Ø±Õmca
    ÊäÈë²ÎÊıËµÃ÷£ºobj: Ö¸ÏòÓÉmca_open´ò¿ªµÄ¾ä±ú
    ·µ»ØÖµËµÃ÷  £º0£¬»òÕß´íÎóºÅ
---------------------------------------------------------------------*/
s32  McaClose(HMcaObj * ptObj);


/*====================================================================
    º¯ÊıÃû      : McaReinit
    ¹¦ÄÜ        £ºÖØĞÂ³õÊ¼»¯MCA£¬Ä¿Ç°Ö»ÓĞdwDBufVaild£¬dwRcvDBufStra£¬dwRcvDBufNum
				tRcvBuffer ²ÎÊıÉúĞ§
    ÊäÈë²ÎÊıËµÃ÷£ºobj: Ö¸ÏòÓÉmca_open´ò¿ªµÄ¾ä±ú
    					      ptParam:²ÎÊıÖ¸Õë
    ·µ»ØÖµËµÃ÷  £º0£¬»òÕß´íÎóºÅ
---------------------------------------------------------------------*/
s32  McaReinit(HMcaObj * ptObj, TMcaParam * ptParam);


/*==============================================================================
    º¯ÊıÃû      : McaReadCmdmsg
    ¹¦ÄÜ        :¶ÁÈ¡Ò»ÌõĞÅÁîÏûÏ¢
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
                  pbyBuf:       [I]ÓÃ»§·ÖÅäµÄBuf£¬ÓÃÀ´´æ·Å¶Áµ½µÄÊı¾İ;
                  dwSize:      [IO]ÓÃ»§·ÖÅä£¬ÊäÈëÊ±Ö¸¶¨ÓÃ»§µÄBufµÄ´óĞ¡£¬Èç¹û×ã¹»´ó£¬
                  		Ôò¶ÁÈ¡³É¹¦
                  nTimeout:     [I]³¬Ê±Öµ: 0=Á¢¼´·µ»Ø, -1=ÓÀÔ¶µÈ´ı, >0=µÈ´ıºÁÃëÊı                  			
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ»òÕßÊµ¼Ê¶Á³ö³¤¶È
------------------------------------------------------------------------------*/
s32 McaReadCmdmsg(HMcaObj * ptObj, u8 *pbyBuf, u32 dwSize, s32 nTimeout);


/*==============================================================================
    º¯ÊıÃû      : McaWriteCmdmsg
    ¹¦ÄÜ        :Ğ´ÈëÒ»ÌõĞÅÁîÏûÏ¢
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
    		dwChipid:	[O]·¢Íù ĞÅÏ¢µÄchipid
                  pbyBuf:       [O]ÓÃ»§·ÖÅäµÄBuf£¬ÓÃÀ´´æ·Å·¢ËÍµÄÊı¾İ;
                  dwSize:      [IO]ÓÃ»§·ÖÅä£¬ÊäÈëÊ±Ö¸¶¨ÓÃ»§µÄBufµÄ´óĞ¡
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
s32 McaWriteCmdmsg(HMcaObj * ptObj, u32 dwChipid, u8 *pbyBuf, u32 dwSize);


/*==============================================================================
    º¯ÊıÃû      : McaReadDataMsg
    ¹¦ÄÜ        :¶ÁÈ¡Ò»ÌõdataÏûÏ¢£¬Ö÷ÒªÓÃ»§ÂãÊı¾İ´«Êä
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
                  pdwVirtaddr:		Ö¸ÏòĞéÄâµØÖ·µÄÖ¸Õë£¬Èç¹û¸ÃĞéÄâµØÖ·Îª0£¬±íÊ¾Ê¹ÓÃÔ¤ÏÈ
                  		¶¨ÒåºÃµÄbuf£¬¶ÁÈ¡³É¹¦ºó£¬Çı¶¯»á½«ĞéÄâµØÖ·Ìî½øÈ¥£¬Èç¹û
                  		²»Îª0£¬Çı¶¯»á¿½±´Êı¾İ½ø¸ÃĞéÄâµØÖ·
                  pdwSize:      [IO]ÓÃ»§·ÖÅä£¬Ö¸Ïò´óĞ¡µÄÖ¸Õë£¬ÊäÈëÊ±Ö¸¶¨ÓÃ»§µÄBufµÄ´óĞ¡£¬
                  		Èç¹û×ã¹»´óÔò¶ÁÈ¡³É¹¦£¬·µ»ØÊ±Çı¶¯»á½«Êı¾İ´óĞ¡Ìî½øÈ¥
		  pdwPhyaddr: Ö¸ÏòÎïÀíµØÖ·µÄÖ¸Õë£¬Èç¹ûÊÇÔ¤ÏÈ·ÖÅäºÃµÄµØÖ·£¬¶ÁÈ¡³É¹¦ºó
		  		»á½«ÎïÀíµØÖ·Ìî½øÈ¥,Èç¹û²»ÊÇÓÃÔ¤ÏÈ·ÖÅäµÄbuf£¬Ôò²»ÓÃ¹ØĞÄ		  
                  nTimeout:     [I]³¬Ê±Öµ: 0=Á¢¼´·µ»Ø, -1=ÓÀÔ¶µÈ´ı, >0=µÈ´ıºÁÃëÊı                  			
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
s32 McaReadDataMsg(HMcaObj * ptObj, u32 *pdwVirtaddr, u32 *pdwPhyaddr,u32 *pdwSize,  s32 nTimeout);


/*==============================================================================
    º¯ÊıÃû      : McaReadDataMsgDone
    ¹¦ÄÜ        :¶ÁÈ¡µÄÒ»ÌõdataÏûÏ¢ÒÑ¾­´¦ÀíÍê±Ï£¬Õâ¸öµØÖ·¿ÉÒÔÓÃÀ´½øĞĞ
    			ÏÂÒ»ÌõÊı¾İµÄ½ÓÊÕ£¬Ö»ÓĞÔÚÓÃ»§Ìá¹©ÂãÊı¾İbufµÄÊ±ºòÓĞÓÃ
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
                  pbyBuf:       [I]BufµØÖ·£¬ĞéÄâµØÖ·£¬Ö»ÔÚÓÃ»§bufÊ¹ÄÜµÄÊ±ºòÓĞÓÃ
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
s32 McaReadDataMsgDone(HMcaObj * ptObj, u8 *pbyBuf);


/*==============================================================================
    º¯ÊıÃû      : McaWriteDataMsg
    ¹¦ÄÜ        :Ğ´Ò»ÌõÊı¾İÏûÏ¢£¬Ö÷ÒªÓÃÓÚÓÃ»§ÂãÊı¾İĞ´
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
                  pbyBuf:       [O]ÓÃ»§·ÖÅäµÄBuf£¬ÓÃÀ´´æ·Å·¢ËÍµÄÊı¾İ;
                  dwChipid:  ·¢ÍùĞÅÏ¢µÄchipid
                  dwPhyaddr:bufµÄÎïÀíµØÖ·£¬Èç¹ûÊÇÎïÀíµØÖ·Á¬ĞøÇÒ4K¶ÔÆë£¬¿ÉÒÔDMA´«Êä
                  dwSize:      [IO]ÓÃ»§·ÖÅä£¬ÊäÈëÊ±Ö¸¶¨ÓÃ»§µÄBufµÄ´óĞ¡
                  nTimeout:     [I]³¬Ê±Öµ: 0=Á¢¼´·µ»Ø, -1=ÓÀÔ¶µÈ´ı, >0=µÈ´ıºÁÃëÊı
     	 	       		×÷ÓÃ:	ÔÚ¶Ô¶ËÎŞ·¨½ÓÊÕµÄÇé¿ö£¬Îª¼õÉÙDMA×ÊÔ´ÀË·Ñ£¬
     	 	       		±¾¶Ë²»»á·¢ËÍÊı¾İ
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
s32 McaWriteDataMsg(HMcaObj * ptObj, u32 dwChipid, u8 *pbyBuf, u32 dwPhyaddr, u32 dwSize, s32 nTimeout);


/*==============================================================================
    º¯ÊıÃû      : mca_inc_heartbeat
    ¹¦ÄÜ        : Ôö¼Óµ±Ç°µÄĞÄÌøÊı£¬¹©±ğÈË²éÑ¯
    ÊäÈë²ÎÊıËµÃ÷:  ptObj:       ¿ØÖÆ¾ä±ú
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
s32 McaIncHeartbeat(HMcaObj * ptObj);


/*==============================================================================
    º¯ÊıÃû      : mca_get_heartbeat
    ¹¦ÄÜ        : ²éÑ¯Ö¸¶¨ĞÄÌø¼ÆÊı£¬Èç¹û²»ÔÙÀÛ¼Ó£¬ËµÃ÷Í¨ĞÅÒÑ¾­¹ÒËÀ
    ÊäÈë²ÎÊıËµÃ÷:  ptObj:       ¿ØÖÆ¾ä±ú
    					dwChipid:	ĞèÒª²éÑ¯µÄĞ¾Æ¬µÄid
    ·µ»ØÖµËµÃ÷  : ĞÄÌø£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
u32 McaGetHeartbeat(HMcaObj * ptObj, u32 dwChipid);

/*==============================================================================
    º¯ÊıÃû      : McaGetReservedMem
    ¹¦ÄÜ        : »ñÈ¡±£ÁôµÄÎïÀíµØÖ·Á¬ĞøµÄÄÚ´æ£¬±ØĞëÔÚMCAopenÖ®ºóµ÷ÓÃ
    			  ÇÒÖ»ÄÜµ÷ÓÃÒ»´Î£¬»ñÈ¡µÄmemÊÇ´øcacheµÄmem
    ÊäÈë²ÎÊıËµÃ÷: 
    					dwPhyAddr:	»ñÈ¡reserved memµÄÎïÀíµØÖ·£¬´«ÈëÊ±Ğ´NULL
    					dwVirAddr:	»ñÈ¡reserved memµÄĞéÄâµØÖ·£¬´«ÈëÊ±Ğ´NULL
    					dwLen:	ĞèÒª»ñÈ¡µÄ³¤¶È
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
u32 McaGetReservedMem(u32 *dwPhyAddr, u32 *dwVirAddr, u32 dwLen);

/*==============================================================================
    º¯ÊıÃû      : McaDmaTransfer
    ¹¦ÄÜ        : ½øĞĞdma´«Êä£¬´«ÊäÖ®Ç°Ä¬ÈÏ»áË¢Ò»´Îcache
    ÊäÈë²ÎÊıËµÃ÷: 
    					dwSrcPhyAddr:		Ô´ÎïÀíµØÖ·
    					dwSrcVirtAddr:		Ô´ĞéÄâµØÖ·
    					dwDstPhyAddr:	Ä¿µÄÎïÀíµØÖ·
    					dwDstVirtAddr:		Ä¿µÄĞéÄâµØÖ·
    					dwLen:	´«Êä³¤¶È£¬4K¶ÔÆë
    					dwCacheMode:	Ë¢cache·½Ê½:
    									SRC_FLUSH_DST_NONCOHERENT:	Ë¢Ô´µØÖ·cache
    									SRC_NONFLUSH_DST_COHERENT:	Í¬²½Ä¿µÄµØÖ·cache
    									SRC_NONFLUSH_DST_NONCOHERENT :	½Ô²»ĞèÒª
    									SRC_FLUSH_DST_COHERENT:½ÔĞèÒª    									
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
u32 McaDmaTransfer(u32 dwSrcPhyAddr, u32 dwSrcVirtAddr, u32 dwDstPhyAddr, u32 dwDstVirtAddr, u32 dwLen, u32 dwCacheMode);


/*====================================================================
    º¯ÊıÃû      : McaEdmaFill2D
    ¹¦ÄÜ        £ºTi81xx Edma 2D Fill
    ÊäÈë²ÎÊıËµÃ÷£ºpixPhyAddr: Ô´ÎïÀíµØÖ·
    			  dstPhyAddr: Ä¿µÄÎïÀíµØÖ·
    			  width:	  2DÇøÓòµÄ¿í
    			  height:	  2DÇøÓòµÄ¸ß
    			  pitch:	  Ä¿±êÍ¬²½³¤¶È
    			  bpp:		  ÏñËØ×Ö½ÚÊı
    ·µ»ØÖµËµÃ÷  £º0£¬»òÕß´íÎóºÅ
----------------------------------------------------------------------
    ĞŞ¸Ä¼ÇÂ¼    £º
    ÈÕ  ÆÚ      °æ±¾        ĞŞ¸ÄÈË        ĞŞ¸ÄÄÚÈİ
    13/05/24    1.0        ÖÜĞÂĞÇ        ´´½¨
====================================================================*/
u32 McaEdmaFill2D(u32 pixPhyAddr, u32 dstPhyAddr, u32 width, u32 height, u32 pitch, u32 bpp);


/*==============================================================================
    º¯ÊıÃû      : McaCacheFlush
    ¹¦ÄÜ        : Ë¢Ò»´Îcache
    ÊäÈë²ÎÊıËµÃ÷: 
    					VirtAddr:		ÔĞéÄâµØÖ·
    					dwLen:	´«Êä³¤¶È£¬4K¶ÔÆë
    					dwCacheMode:	Ë¢cache·½Ê½:
    									SRC_FLUSH_DST_NONCOHERENT:	Ë¢Ô´µØÖ·cache
    									SRC_NONFLUSH_DST_COHERENT:	Í¬²½Ä¿µÄµØÖ·cache
    ·µ»ØÖµËµÃ÷  : 0£¬»òÕß´íÎóºÅ
------------------------------------------------------------------------------*/
u32 McaCacheFlush(u32 VirtAddr, u32 dwLen, u32 dwCacheMode);


/*==============================================================================
    º¯ÊıÃû      : McaPrtEnable
    ¹¦ÄÜ        : ÔÊĞí¶ÔÓ¦chipidµÄ´òÓ¡ĞÅÏ¢´òÓ¡µ½RC£¬Ö»ÄÜRCµ÷ÓÃ
    ÊäÈë²ÎÊıËµÃ÷: dwChipid:	ĞèÒª²éÑ¯µÄĞ¾Æ¬µÄid
    ·µ»ØÖµËµÃ÷  : ÎŞ
------------------------------------------------------------------------------*/
void McaPrtEnable(u32 dwChipid);


/*==============================================================================
    º¯ÊıÃû      : McaPrtDisable
    ¹¦ÄÜ        : ²»ÔÊĞí¶ÔÓ¦chipidµÄ´òÓ¡ĞÅÏ¢´òÓ¡µ½RC£¬Ö»ÄÜRCµ÷ÓÃ
    ÊäÈë²ÎÊıËµÃ÷: dwChipid:	Ğ¾Æ¬µÄid
    ·µ»ØÖµËµÃ÷  : ÎŞ
------------------------------------------------------------------------------*/
void McaPrtDisable(u32 dwChipid);


/*==============================================================================
    º¯ÊıÃû      : McaPrtFuncRegister
    ¹¦ÄÜ        : ÒµÎñ×¢²á´òÓ¡º¯Êı
    ÊäÈë²ÎÊıËµÃ÷: pfHookFunc--ÒµÎñµÄ´òÓ¡º¯Êı
    ·µ»ØÖµËµÃ÷  : ÎŞ
------------------------------------------------------------------------------*/
void McaPrtFuncRegister(TEPPrtFunc pfHookFunc);


/*==============================================================================
    º¯ÊıÃû      : McaPrtStart
    ¹¦ÄÜ        : rc¶ËÆô¶¯log¼à¿ØÏß³Ì
    ÊäÈë²ÎÊıËµÃ÷: ptObj ¿ØÖÆ¾ä±ú
    ·µ»ØÖµËµÃ÷  : ÎŞ
------------------------------------------------------------------------------*/
void McaPrtStart(HMcaObj *ptObj);


/*==============================================================================
    º¯ÊıÃû      : McaEpPrintf
    ¹¦ÄÜ        : ep´òÓ¡º¯Êı£¬¸Ãº¯Êı¿ÉÒÔ½«´òÓ¡Êä³öÖÁ¿ØÖÆÌ¨¼°epµÄlog ring buffer
    ÊäÈë²ÎÊıËµÃ÷: ptObj:       ¿ØÖÆ¾ä±ú
		  fmt, ...:  ¸ñÊ½Í¨Åä¼°²ÎÊı
    ·µ»ØÖµËµÃ÷  : ÎŞ
------------------------------------------------------------------------------*/
void McaEpPrintf(HMcaObj *ptObj, const char *fmt, ...);

#ifdef __cplusplus 
}
#endif /* __cplusplus */


#endif // __MCA_LIB_


