/*****************************************************************************
模块名      : DSPCCI
文件名      : dm6437cci_api.h
相关文件    : dm6437cci_api.c
文件实现功能:  DM6437侧cci通信协议相关的宏和数据结构定义，被上层应用包含，
作者        : 张方明
版本        : V1.0  Copyright(C) 2008-2010KEDACOM, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期      版本        修改人      修改内容
04/23/2009  01a         张方明     创建.	
******************************************************************************/

#ifndef __DM6437CCI_API_H
#define __DM6437CCI_API_H

#ifdef __cplusplus
extern "C" {
#endif


#include <stdlib.h>
#include "dm6437_drv_common.h"
#include "dspcci_common.h"

typedef struct{
    u32 dwUpChnls;                  /* 上行通道数 */
    u32 dwDnChnls;                  /* 下行通道数 */
} TCciParam;


/* 全局函数声明 */
/*==============================================================================
    函数名      : Dm6437CciOpen
    功能        : 打开CCI通信接口
    输入参数说明: ptCciParam:       [O]返回给用户的通道信息
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciOpen(TCciParam *ptCciParam);

/*==============================================================================
    函数名      : Dm6437CciClose
    功能        : 关闭CCI通信接口
    输入参数说明: 无
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciClose(void);

/*==============================================================================
    函数名      : Dm6437CciWriteMsg
    功能        : 通过指定上行通道写一个消息包给HOST
    输入参数说明: dwChnl:       [I]上行通道索引;
                  ptMsgDesc:    [I]消息描述;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciWriteMsg(u32 dwChnl, TDspCciMsgDesc *ptMsgDesc);

/*==============================================================================
    函数名      : Dm6437CciReadMsg
    功能        : 通过指定CCI通信接口的下行通道读取一个消息包到用户的Buf，
                  不能和Dm6437CciRecvMsg混用。
    输入参数说明: dwChnl:       [I]下行通道索引;
                  pbyBuf:       [I]用户分配的Buf，用来存放读到的数据;
                  pdwSize:      [IO]用户分配，输入时指定用户的Buf的大小，如果足够大
                                    则写入数据并返回写入的数据长度;否则返回错误
                  nTimeout:     [I]超时值: 0=立即返回, -1=永远等待, >0=等待毫秒数
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciReadMsg(u32 dwChnl, u8 *pbyBuf, u32 *pdwSize, l32 nTimeout);

/*==============================================================================
    函数名      : Dm6437CciRecvMsg
    功能        : 通过指定CCI通信接口的下行通道接口接收一个消息包，并告知用
                  户消息的地址，用户处理完后调用Dm6437CciRecvMsgDone释放该消息包。
                  不能和Dm6437CciReadMsg混用。
    输入参数说明: dwChnl:       [I]下行通道索引;
                  ptMsgDesc:    [IO]用户分配，用来存放接收的数据包的地址长度等信息;
                  nTimeout:     [I]超时值: 0=立即返回, -1=永远等待, >0=等待毫秒数
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciRecvMsg(u32 dwChnl, TDspCciMsgDesc *ptMsgDesc, l32 nTimeout);

/*==============================================================================
    函数名      : Dm6437CciRecvMsgDone
    功能        : 和Dm6437CciRecvMsg配对使用，用户处理完后Dm6437CciRecvMsg得到的数据后
                  调用需调用本函数从接收对列中释放该消息包。
    输入参数说明: dwChnl:       [I]下行通道索引;
                  ptMsgDesc:    [I]需要将Dm6437CciRecvMsg调用时分配的结构变量传入;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciRecvMsgDone(u32 dwChnl, TDspCciMsgDesc *ptMsgDesc);

/*==============================================================================
    函数名      : Dm6437CciIncHeartBeat
    功能        : 增加心跳计数。
    输入参数说明: 无;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciIncHeartBeat(void);

/*==============================================================================
    函数名      : Dm6437CciSetErrLog
    功能        : 设置指定的错误日志。
    输入参数说明: dwErrId:      [I]错误日志索引，0~DSPCCI_ERR_LOG_MAX_NUM-1;
                  dwErrLog:     [I]错误日志数据;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciSetErrLog(u32 dwErrId, u32 dwErrLog);

/*==============================================================================
    函数名      : Dm6437CciClearDnChnl
    功能        : 清空指定的下行通道数据。
    输入参数说明: dwChnl:       [I]下行通道索引;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciClearDnChnl(u32 dwChnl);

/*==============================================================================
    函数名      : Dm6437CciGetVer
    功能        : 模块版本号查询。
    输入参数说明: pchVer: 给定的存放版本信息的buf指针
                  dwBufLen:给定buf的长度
    返回值说明  : 版本的实际字符串长度。小于0为出错;
                  如果实际字符串长度大于dwBufLen，赋值为0
------------------------------------------------------------------------------*/
l32 Dm6437CciGetVer(s8 *pchVer, u32 dwBufLen);

/*==============================================================================
    函数名      : Dm6437CciGetRxMsgNum
    功能        : 查询接收缓冲Buf中缓存的消息包数。
    输入参数说明: dwChnl:       [I]下行通道索引;
                  pdwMsgNum:    [O]返回给用户的消息包数;
    返回值说明  : 错误返回DSPCCI_FAILURE或错误码；成功返回DSPCCI_SUCCESS
------------------------------------------------------------------------------*/
l32 Dm6437CciGetRxMsgNum(u32 dwChnl, u32 *pdwMsgNum);

/*==============================================================================
    函数名      : Dm6437CciPrintf
    功能        : 打印数据到Host侧显示
    输入参数说明: pFmtStr: 格式化的多参字符串
    返回值说明  : 无
------------------------------------------------------------------------------*/
void  Dm6437CciPrintf(const char *pFmtStr, ...);

#ifdef __cplusplus 
}
#endif /* __cplusplus */

#endif /* __DM6437CCI_API_H */
