/*******************************************************************************
 *  模块名   :                                                                 *
 *  文件名   : mtmp.h                                                          *
 *  相关文件 :                                                                 *
 *  实现功能 :                                                                 *
 *  作者     : 张明义                                                          *
 *  版本     : V4.0  Copyright(c) 1997-2005 KDC, All rights reserved.          *
 *                                                                             *
 *    =======================================================================  *
 *  修改记录:                                                                  *
 *    日  期      版本        修改人      修改内容                             *
 *  2005/12/5     4.0         张明义      创建                                 *
 *                                                                             *
 *******************************************************************************/


#ifndef _MT_MP_H_
#define _MT_MP_H_

#include "kdvdef.h"

//API BOOL InitDSP();
//xjx_070914
API BOOL InitDSP( BOOL bMcEnable = FALSE );

#endif

