// VasControl.h: 


#ifndef _VAS_CONTROL_H
#define _VAS_CONTROL_H

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "osp.h"
#include "vasstructdef.h"
#include "vaseventdef.h"

/*====================================================================
  u8 byEventID 定义见VasEventDef.h
  只有byEventID等于EVENT_GET_CONFIG_NOTIFY时，TVasConfigu& byConfigure才有用
  ====================================================================*/ 
typedef void ( * TVasCallBack )( u8 byEventID, TVasConfigu& byConfigure);


class CVasControl  
{
public:
	CVasControl();
	virtual ~CVasControl();
public:
	/*=======================================================================
    函 数 名:AskConfigure
    功    能:请求配置
    参    数:u8 MediaType                       [in]媒体类型
             u8 index                           [in]配置方案索引号
    返 回 值:成功返回0,失败返回错误码
    -------------------------------------------------------------------------
    修改纪录:
    日      期  版本  修改人  修改内容
=======================================================================*/
	u16 VasAskForConfig(u8 Index,u8 MediaType);
	/*=======================================================================
    函 数 名:SaveConfigByVasLib
    功    能:保存当前配置
    参    数:TVasConfigu &tConfigure            [in]配置方案
            
    返 回 值:成功返回0,失败返回错误码
    -------------------------------------------------------------------------
    修改纪录:
    日      期  版本  修改人  修改内容
=======================================================================*/
	u16 VasSaveConfig(TVasConfigu &tConfigure);
	/*=======================================================================
    函 数 名:VasSwitchChannel
    功    能:进行VAS交换
    参    数:u8 MediaType                     [in]媒体类型
            u8 InputChann                     [in]输入通道号,从0开始
            u8 OutputChann                    [in]输出通道号，从0开始
    返 回 值:成功返回0,失败返回错误码
    -------------------------------------------------------------------------
    修改纪录:
    日      期  版本  修改人  修改内容
=======================================================================*/
	u16 VasSwitchChannel(u8 MediaType, u8 InputChann,u8 OutputChann);
	/*=======================================================================
    函 数 名:VasConnect
    功    能:连接VAS板
    参    数:u32 dwIP                  [in]终端的IP(网络序)
            u16 wPort                  [in]连接的端口号
			u8 ChannelNumber           [in]界面中允许显示的channel数量
    返 回 值:成功返回0,失败返回错误码
    -------------------------------------------------------------------------
    修改纪录:
    日      期  版本  修改人  修改内容
=======================================================================*/
	u16 VasConnect(u32 dwIP, u16 wPort,u8 ChannelNumber);
	/*====================================================================
    函数名      : CloseVasLib
    功能        : 释放CloseVasLib
    输入参数说明: 无
    返回值说明  : 无
====================================================================*/
	void CloseVasLib();
	/*====================================================================
    函数名      : InitVasLib
    功能        : 初始化lib
    输入参数说明: TVasCallBack  tVasCallBack       回调函数 		
    返回值说明  : 				
====================================================================*/  
	s32 InitVasLib(TVasCallBack  tVasCallBack);
	/*====================================================================
    函数名      : InitVasLib
    功能        : 初始化lib
    输入参数说明: TVasCallBack  tVasCallBack       回调函数 		
    返回值说明  : 				
====================================================================*/  
	void VasLibVersion();
	
};

#endif // _VAS_CONTROL_H



