/*==============================================================================
功能    :  所有外设与生产测试服务器共用信息
-------------------------------------------------------------------------------
修改记录:  
日  期     版本          修改人          走读人          修改记录		
2012/02/14 1.0           周嘉麟                          创建				
==============================================================================*/
#ifndef EQP_SERVER_TEST_H
#define EQP_SERVER_TEST_H

#include "kdvtype.h"
#include "osp.h"

#define  SERVER_APPID                      (u8)100

#endif
