/*****************************************************************************
模块名      : vrs
文件名      : evvrsterminal.h
相关文件    : 
文件实现功能: 录播主控与其他H323/sip实体通信消息定义
作者        : pengjie
版本        : V2R1  Copyright(C) 2013-2015 KDC, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期      版本        修改人      修改内容
2013/09/12  V2R1        pengjie       create
******************************************************************************/
#ifndef _EVVRSTERMINAL_H_
#define _EVVRSTERMINAL_H_

/*以下消息为vrs与其他H323/SIP实体交互的消息，
所有消息格式为：消息号(u16)+消息长度+(u16)+消息体，
下面只描述消息体部分，不再重复加上“消息号(u16)+消息长度+(u16)”部分*/

// 临时定义消息起始
const u16 EV_VRSTERMINAL_BGN = 2800;

/*====================================================================
消息号: VRS_TERMINAL_STATUS_NTF
功能:	状态上报
消息体:	录像状态/放像状态
说明:	录像状态:
		录像状态(u8)+发布方式(u8)+是否直播(u8)+文件名长度(u16)+录像文件名(不定长)(录像状态: ERPWorkState)
		放像状态:
		放像状态(u8)+文件名长度(u16)+放像文件显示名(不定长) (放像状态: ERPWorkState)
====================================================================*/
OSPEVENT(VRS_TERMINAL_STATUS_NTF,                 EV_VRSTERMINAL_BGN + 0);

/*====================================================================
消息号: VRS_TERMINAL_PLYPROG_NTF
功能:	进度上报
消息体:	录像进度/放像进度
说明:	进度: 当前进度(u32)+总进度(u32)(录像总进度=0)
====================================================================*/
OSPEVENT(VRS_TERMINAL_PROG_NTF,                 EV_VRSTERMINAL_BGN + 1);

/*====================================================================
消息号: TERMINAL_VRS_SETRECPARAM_REQ
功能:	设置录像参数
消息体:	参数类型(u8)+参数长度(u16)+参数(不定长)
说明:	参数类型=1: 录像文件名(不定长)
		参数类型=2: 发布方式(u8)
		参数类型=3: 是否直播(u8)
====================================================================*/
OSPEVENT(TERMINAL_VRS_SETRECPARAM_REQ,           EV_VRSTERMINAL_BGN + 2);

/*====================================================================
消息号: VRS_TERMINAL_SETRECPARAM_RSP
功能:	设置录像参数回应
消息体:	回应类型(u8)+错误号(u16)
说明:	回应类型=0: ack
		回应类型=1: nack
====================================================================*/
OSPEVENT(VRS_TERMINAL_SETRECPARAM_RSP,           EV_VRSTERMINAL_BGN + 3);

/*====================================================================
消息号: TERMINAL_VRS_GETFILELIST_REQ
功能:	获取文件信息
消息体:	文件组Id(u32)+起始条目(u32)+获取条目数(u32)
说明:	文件组Id=0, 起始条目=0, 获取条目数=0: 表示获取所有分组信息
		文件组Id=1, 起始条目=0, 获取条目数=0: 表示系统所有文件
		文件组Id=x, 起始条目=0, 获取条目数=0: 表示获取该组下全部文件
====================================================================*/
OSPEVENT(TERMINAL_VRS_GETFILELIST_CMD,           EV_VRSTERMINAL_BGN + 4);

/*====================================================================
消息号: VRS_TERMINAL_FILELIST_NTF
功能:	获取文件信息
消息体:	个数N(u32)+ N*文件信息
说明:	文件信息=文件类型(u8)+ID(u32)+名字(s8*129)+number(u32)
		文件类型：0=普通视频文件，1=文件组
		如果文件类型=0，文件信息=文件类型+文件ID+文件名字+文件所属组ID
		如果文件类型=1，文件信息=文件类型+文件组ID+组名+组内文件个数
====================================================================*/
OSPEVENT(VRS_TERMINAL_FILELIST_NTF,           EV_VRSTERMINAL_BGN + 5);

/*====================================================================
消息号: TERMINAL_VRS_SETPLYPARAM_REQ
功能:	设置录像参数
消息体:	参数类型(u8)+参数长度(u16)+参数(不定长)
说明:	参数类型=1：播放文件的文件ID(u32)
		参数类型=2：播放时间(u32)
====================================================================*/
OSPEVENT(TERMINAL_VRS_SETPLYPARAM_CMD,           EV_VRSTERMINAL_BGN + 6);


#endif // _EVVRSTERMINAL_H_

// END OF FILE