/*****************************************************************************
   模块名      : Board Agent
   文件名      : driconfig.h
   相关文件    : 
   文件实现功能: 相关配置函数定义
   作者        : jianghy
   版本        : V0.9  Copyright(C) 2001-2002 KDC, All rights reserved.
-----------------------------------------------------------------------------
   修改记录:
   日  期      版本        修改人      修改内容
   2003/08/25  1.0         jianghy       创建
   2004/12/05  3.5         李 博        新接口的修改
******************************************************************************/
#ifndef DRICONFIG_H
#define DRICONFIG_H

#include "boardconfigbasic.h"

class CDriConfig:public CBBoardConfig
{
public:
	CDriConfig();
	~CDriConfig();
    friend class CBoardAgent;
	/*====================================================================
	功能：是否运行Prs
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunPrs();

	/*====================================================================
	功能：获取prs配置信息
	参数：无
	返回值：MCU的端口号，0表示失败
	====================================================================*/
	BOOL GetPrsCfg( TPrsCfg* ptCfg );

	/*====================================================================
	功能：设置PRS的配置信息
	参数：无
	返回值：TRUE/FALSE
	====================================================================*/
	BOOL SetPrsConfig( TEqpPrsEntry *ptPrsCfg );
	
private:
	BOOL    bIsRunPrs;      //是否运行PRS
	TPrsCfg m_prsCfg;
};

#endif      /* DRICONFIG_H */
