/*****************************************************************************
   模块名      : Board Agent
   文件名      : imtconfig.h
   相关文件    : 
   文件实现功能: 相关配置函数定义
   作者        : jianghy
   版本        : V0.9  Copyright(C) 2001-2002 KDC, All rights reserved.
-----------------------------------------------------------------------------
   修改记录:
   日  期      版本        修改人      修改内容
   2003/08/25  1.0         jianghy       创建
   2004/12/05  3.5         李 博        新接口的修改
******************************************************************************/
#ifndef IMTCONFIG_H
#define IMTCONFIG_H

#include "mcuagtstruct.h"

typedef struct
{
	u8		byMAPId;		/*MAP处理器编号*/
	u32		dwMAPCoreSpeed;	/*MAP处理器主频*/
	u32		dwMAPMemSpeed;	/*MAP处理器内存主频*/
	u32		dwMAPMemSize;	/*MAP处理器内存容量*/
	u8		byMAPPort;		/*MAP处理器视频端口*/
}TMAPInfo;

class CImtConfig
{
	friend class CBoardAgent;

public:
	/*====================================================================
	功能：获取单板的槽位号
	参数：无
	返回值：ID值，0表示失败
	====================================================================*/
	u8	GetBoardId();

	/*====================================================================
	功能：获取要连接的MCU的ID
	参数：无
	返回值：MCU的ID，0表示失败
	====================================================================*/
	u8 GetConnectMcuId();

	/*====================================================================
	功能：获取要连接的MCU的IP地址(网络序)
	参数：无
	返回值：MCU的IP地址(网络序)，0表示失败
	====================================================================*/
	u32 GetConnectMcuIpAddr();

	/*====================================================================
	功能：获取连接的MCU的端口号
	参数：无
	返回值：MCU的端口号，0表示失败
	====================================================================*/
	u16  GetConnectMcuPort();

	/*====================================================================
	功能：是否运行混音器
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunMixer();

	/*====================================================================
	功能：是否运行BAS
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunBas();

	/*====================================================================
	功能：是否运行VMP
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunVMP();

	/*====================================================================
	功能：是否运行Prs
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunPrs();

	/*====================================================================
	功能：是否运行TVWALL
	参数：无
	返回值：运行返回TRUE，反之FALSE
	====================================================================*/
	BOOL IsRunTVWall();

	/*====================================================================
	功能：获取Mixer的MAP个数
	参数：u8* pbyIdBuf: 存放MAP编号的数组 
	      u8 byBufLen: 数组长度
	返回值：MAP个数
	====================================================================*/
	u8 GetMixerMAPId( u8* pbyIdBuf, u8 byBufLen );

	/*====================================================================
	功能：获取TVWall的MAP个数
	参数：u8* pbyIdBuf: 存放MAP编号的数组 
	      u8 byBufLen: 数组长度
	返回值：MAP个数
	====================================================================*/
	u8 GetTVWallMAPId( u8* pbyIdBuf, u8 byBufLen );

	/*====================================================================
	功能：获取Bas的MAP个数
	参数：u8* pbyIdBuf: 存放MAP编号的数组 
	      u8 byBufLen: 数组长度
	返回值：MAP个数
	====================================================================*/
	u8 GetBasMAPId( u8* pbyIdBuf, u8 byBufLen );

	/*====================================================================
	功能：获取VMP的MAP个数
	参数：u8* pbyIdBuf: 存放MAP编号的数组 
	      u8 byBufLen: 数组长度
	返回值：MAP个数
	====================================================================*/
	u8 GetVMPMAPId( u8* pbyIdBuf, u8 byBufLen );

	/*====================================================================
	功能：获取MAP信息
	参数：u8 byId: MAP号
	      u32 *pdwCoreSpeed: MAP主频
		  u32 *pdwMemSpeed: MAP的内存主频
		  u32 *pdwPort: MAP的端口号
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetMAPInfo(u8 byId, u32 *pdwCoreSpeed, u32 *pdwMemSpeed, u32 *pdwMemSize, u32 *pdwPort);


	/*Mixer的配置信息接口*/

	/*====================================================================
	功能：获取Mixer的ID
	参数：无
	返回值：Mixer的ID，0表示失败
	====================================================================*/
	u8 GetMixerId();

	/*====================================================================
	功能：获取Mixer的类型
	参数：无
	返回值：Mixer的类型，0表示失败
	====================================================================*/
	u8 GetMixerType();

	/*====================================================================
	功能：获取Mixer的假名
	参数：s8* lpstrBuf, Alias字符串指针，内存需用户申请
          u16  wLen, Alias字符串缓冲区大小，若小于实际长度，返回字符串予以截断
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetMixerAlias(s8* lpstrBuf, u16  wLen);
	
	/*====================================================================
	功能：获取Mixer的IP(网络序)
	参数：无
	返回值：Mixer的IP(网络序)，0表示失败
	====================================================================*/
	u32 GetMixerIpAddr();
	
	/*====================================================================
	功能：获取Mixer的起始接收端口号
	参数：无
	返回值：起始接收端口号，0表示失败
	====================================================================*/
	u16  GetMixerRecvStartPort();

	/*====================================================================
	功能：获取混音器每个MAP的支持最大混音组数
	参数：无
	返回值：最大混音组数，0表示失败
	====================================================================*/
	u8 GetMixerMaxMixGroupNum();
	
	/*====================================================================
	功能：获取每个混音组最大通道数
	参数：无
	返回值：最大通道数，0表示失败
	====================================================================*/
	u8 GetMixerMaxChannelInGrp();


	/*TVWALL的配置信息接口*/

	/*====================================================================
	功能：获取TVWall的ID
	参数：无
	返回值：TVWall的ID，0表示失败
	====================================================================*/
	u8 GetTWId();

	/*====================================================================
	功能：获取TVWall的类型
	参数：无
	返回值：TVWall的类型，0表示失败
	====================================================================*/
	u8 GetTWType();

	/*====================================================================
	功能：获取TVWall的假名
	参数：s8* lpstrBuf, Alias字符串指针，内存需用户申请
          u16  wLen, Alias字符串缓冲区大小，若小于实际长度，返回字符串予以截断
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetTWAlias(s8* lpstrBuf, u16  wLen);

	/*====================================================================
	功能：获取TVWall的IP(网络序)
	参数：无
	返回值：TVWall的IP(网络序)，0表示失败
	====================================================================*/
	u32 GetTWIpAddr();

	/*====================================================================
	功能：获取TVWall视频起始接收端口号
	参数：无
	返回值：起始接收端口号，0表示失败
	====================================================================*/
	u16  GetTWRecvStartPort();

	/*====================================================================
	功能：获取电视墙的分割方式
	参数：无
	返回值：分割方式，0表示失败
	====================================================================*/
	u8 GetTWDivStyle();

	/*====================================================================
	功能：获取电视墙的分割画面数
	参数：无
	返回值：分割画面数，0表示失败
	====================================================================*/
	u8 GetTWDivNum();


	/*BAS的配置信息接口*/

	/*====================================================================
	功能：获取Bas的ID
	参数：无
	返回值：Bas的ID，0表示失败
	====================================================================*/
	u8 GetBasId();

	/*====================================================================
	功能：获取Bas的类型
	参数：无
	返回值：Bas的类型，0表示失败
	====================================================================*/
	u8 GetBasType();

	/*====================================================================
	功能：获取Bas的假名
	参数：s8* lpstrBuf, Alias字符串指针，内存需用户申请
          u16  wLen, Alias字符串缓冲区大小，若小于实际长度，返回字符串予以截断
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetBasAlias(s8* lpstrBuf, u16  wLen);
	
	/*====================================================================
	功能：获取Bas的IP(网络序)
	参数：无
	返回值：Bas的IP(网络序)，0表示失败
	====================================================================*/
	u32 GetBasIpAddr();
	
	/*====================================================================
	功能：获取Bas的起始接收端口号
	参数：无
	返回值：起始接收端口号，0表示失败
	====================================================================*/
	u16  GetBasRecvStartPort();

	/*====================================================================
	功能：获取Bas的每个MAP的最大试配通道数
	参数：无
	返回值：最大试配通道数，0表示失败
	====================================================================*/
	u8 GetBasMaxAdpChannel();


	
	/*VMP的配置信息接口*/

	/*====================================================================
	功能：获取VMP的ID
	参数：无
	返回值：VMP的ID，0表示失败
	====================================================================*/
	u8 GetVMPId();

	/*====================================================================
	功能：获取VMP的类型
	参数：无
	返回值：VMP的类型，0表示失败
	====================================================================*/
	u8 GetVMPType();

	/*====================================================================
	功能：获取VMP的假名
	参数：s8* lpstrBuf, Alias字符串指针，内存需用户申请
          u16  wLen, Alias字符串缓冲区大小，若小于实际长度，返回字符串予以截断
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetVMPAlias(s8* lpstrBuf, u16  wLen);
	
	/*====================================================================
	功能：获取VMP的IP(网络序)
	参数：无
	返回值：VMP的IP(网络序)，0表示失败
	====================================================================*/
	u32 GetVMPIpAddr();
	
	/*====================================================================
	功能：获取VMP的起始接收端口号
	参数：无
	返回值：起始接收端口号，0表示失败
	====================================================================*/
	u16  GetVMPRecvStartPort();

	/*====================================================================
	功能：获取VMP同时视频解码路数
	参数：无
	返回值：解码路数，0表示失败
	====================================================================*/
	u8  GetVMPDecodeNumber();


// Mpw 
    u8  GetMpwId();
    u8  GetMpwType();
    BOOL32 GetMpwAlias(s8* lpstrBuf, u16  wLen);
    u32 GetMpwIpAddr(); // 网络序
    u16  GetMpwRecvStartPort();
    BOOL32 IsRunMpw();
    u8  GetMpwMAPId( u8* pbyIdBuf, u8 byBufLen );

    //设置Mpw的配置信息
    BOOL32 SetMpwConfig(TEqpMPWEntry* ptMpwCfg);
	/*Prs的配置信息接口*/

	/*====================================================================
	功能：获取Prs的ID
	参数：无
	返回值：Prs的ID，0表示失败
	====================================================================*/
	u8 GetPrsId();

	/*====================================================================
	功能：获取Prs的类型
	参数：无
	返回值：Prs的类型，0表示失败
	====================================================================*/
	u8 GetPrsType();

	/*====================================================================
	功能：获取Prs的假名
	参数：s8* lpstrBuf, Alias字符串指针，内存需用户申请
          u16  wLen, Alias字符串缓冲区大小，若小于实际长度，返回字符串予以截断
	返回值：成功返回TRUE，反之FALSE
	====================================================================*/
	BOOL GetPrsAlias(s8* lpstrBuf, u16  wLen);
	
	/*====================================================================
	功能：获取Prs的IP(网络序)
	参数：无
	返回值：Prs的IP(网络序)，0表示失败
	====================================================================*/
	u32 GetPrsIpAddr();
	
	/*====================================================================
	功能：获取Prs的起始接收端口号
	参数：无
	返回值：起始接收端口号，0表示失败
	====================================================================*/
	u16  GetPrsRecvStartPort();

	/*====================================================================
	功能：获取Prs重传参数
	参数：u16* pwFistTimeSpan 第一个重传检测点
	      u16 *pwSecondTimeSpan 第二个重传检测点
		  u16* pwThirdTimeSpan 第三个重传检测点
		  u16* pwRejectTimeSpan 过期丢弃的时间跨度
	返回值：解码路数，0表示失败
	====================================================================*/
	BOOL  GetPrsRetransPara(u16* pwFistTimeSpan, u16 *pwSecondTimeSpan, 
		u16* pwThirdTimeSpan, u16* pwRejectTimeSpan );

	//读配置
	BOOL ReadConfig();

    BOOL32 SetMpcIpAddrA(u32 dwIpAddr);

    BOOL32 SetMpcPortA(u16 wPort);

    u32 GetMpcIpAddrA(void);

    u16 GetMpcPortA(void);

    BOOL32 SetMpcIpAddrB(u32 dwIpAddr);

    BOOL32 SetMpcPortB(u16 wPort);

    u32 GetMpcIpAddrB(void);

    u16 GetMpcPortB(void);

public:
    u32	 m_dwDstMcuNode;
    u32  m_dwDstMcuNodeB;

    u16  m_wDiscHeartBeatTime;
    u8   m_byDiscHeartBeatNum;

    u8   m_byTvWallModel; // 电视墙模式，0：无，1：音频，2：视频，3：音视频
public:
	CImtConfig();
	~CImtConfig();

private:
	//在WINDOWS下读自己的层、槽号
	BOOL ReadBoardInfo();

	//从配置文件读MAP的配置信息
	BOOL ReadMAPConfig();

	u32 GetMAPMemSpeed(u32 wCoreSpeed);
	void TableMemoryFree( void **ppMem, u32 dwEntryNum );


protected:
	//设置MIXER的配置信息
	BOOL SetMixerConfig(TEqpMixerEntry *ptMixerCfg);
	//设置TVWALL的配置信息
	BOOL SetTVWallConfig(TEqpTVWallEntry *ptTVWallCfg);
	//设置BAS的配置信息
	BOOL SetBasConfig(TEqpBasEntry *ptBasCfg);
	//设置VMP的配置信息
	BOOL SetVMPConfig(TEqpVMPEntry *ptVMPCfg);
	//设置Prs的配置信息
	BOOL SetPrsConfig(TEqpPrsEntry *ptPrsCfg);

protected:
	u8	byBrdId;		//单板ID
	BOOL	bIsRunMixer;    //是否运行MIXER
	BOOL	bIsRunTVWall;	//是否运行TVWall
	BOOL	bIsRunBas;		//是否运行Bas
	BOOL	bIsRunVMP;		//是否运行VMP
	BOOL    bIsRunPrs;      //是否运行PRS
    BOOL32  bIsRunMpw;      // 是否运行MPw
    
	u8   byMcuId;		//连接MCU的ID
	u32	 dwMpcIpAddr;	//连接MCU的IP
	u16  wMpcPort;		//连接MCU的端口

    u32  dwMpcIpAddrB;
    u16  wMpcPortB;

    u8   m_byChoice;

	TEqpMixerEntry	m_tMixerCfg;	//MIXER的配置信息
	TEqpTVWallEntry	m_tTVWallCfg;	//TVWALL的配置信息
	TEqpBasEntry	m_tBasCfg;		//BAS的配置信息
	TEqpVMPEntry	m_tVMPCfg;		//VMP的配置信息
	TEqpPrsEntry	m_tPrsCfg;		//Prs的配置信息
    TEqpMPWEntry    m_tMpwCfg;
	u8				byMAPCount;
	TMAPInfo		m_tMAPCfg[5];		//MAP的配置信息
};

#endif    /* IMTCONFIG_H */
