/********************************************************************
*		文件名:		aec_fap.h										*
*		相关文件:	--------										*
*		实现功能:	子带回波抵消的接口头文件						*
*       作者：      汪福明                                          *
*		版本:		1.0												*
*																	*
********************************************************************/

#ifndef _aec_fap_h
#define _aec_fap_h
#ifndef AEC_TYPE_MP3
#define AEC_TYPE_MP3	2		//32K数据率
#endif

#ifndef AEC_TYPE_G711
#define AEC_TYPE_G711	3		//8K数据率
#endif

#ifndef AEC_TYPE_G722
#define AEC_TYPE_G722	4		//16K数据率
#endif

#define AEC_TYPE_STOP	0		//停止AEC

#define AEC_FAP_ERR -1
#define AEC_FAP_OK  0
/*====================================================================
函数名	aecInitialization
功能    ：初始化AEC
使用算法：
参数说明：ppSubHandle：aec使用句柄。
          aecType：    aec类型，MP3或G711等
          
返回值说明：AEC_FAP_OK 成功
            AEC_FAP_ERR，失败

----------------------------------------------------------------------
====================================================================*/
int aecInitialization(void **ppSubHandle,int aecType);

/*====================================================================
函数名	AecFapFree
功能    ：释放AEC
使用算法：
参数说明：pSubHand：aec使用句柄。
          
返回值说明：AEC_FAP_OK 成功
            AEC_FAP_ERR，失败

----------------------------------------------------------------------
====================================================================*/
int	AecFapFree(void *pSubHand);

/*====================================================================
函数名	GetFapAecVersion
功能    ：得到AEC版本
使用算法：
输入参数：
	char *Version: 用来取得版本的空间。
	int StrLen, 用来取得版本的空间大小。
	int * StrLenUsed，版本字符串所占用的空间大小
返回值: 无

----------------------------------------------------------------------
====================================================================*/
void  GetFapAecVersion(char *Version, int StrLen, int * StrLenUsed);

/*====================================================================
函数名	AecTypeSet
功能    ：设置AEC类型
使用算法：
参数说明：pSubHandle ,aec句柄
          aecType, aec类型
返回值说明：AEC_FAP_OK，成功
            AEC_FAP_ERR，失败,参数为NULL

----------------------------------------------------------------------
====================================================================*/
int AecTypeSet(void *pSubHandle,int aecType);

/*=============================================================================
函 数 名：EchoCancelFap
功    能：用于MP3的回声抵消函数,使用FAP算法
算法实现：FAP+子带算法
引用全局变量：
输入参数说明： pEchoBuf  --采集回声数据指针，8K,单声道
               pAecBuf   --回声抵消输出，	 8K,单声道
               pSubHandle--回声抵消句柄，
			   bOutStereo   --输出是否双声道
返 回 值：AEC_FAP_OK，成功
          AEC_FAP_ERR，失败
=============================================================================*/
int EchoCancelFap(void *pSubHandle,short *pEchoBuf,short *pAecBuf,int bOutStereo);

/*====================================================================
函数名	AecMp3RefSet
功能    ：一幀MP3的回声抵消参考数据写入缓冲区。
使用算法：
参数说明：pRefBuf：一幀参考数据，单声道，288个点，
                   总长度是1152×2字节。一个采样点2个字节。
		  pSubHandle, aec句柄
		  int bMute,输入是否静音
		  int bInStereo，输入是否立体声
返回值说明：AEC_FAP_OK，成功
            AEC_FAP_ERR，失败

----------------------------------------------------------------------
====================================================================*/
int	AecMp3RefSet(void *pSubHandle,short *pRefBuf,int bMute,int bInStereo);

/*=============================================================================
函 数 名：EchoCancelG71
功    能：用于G711的回声抵消函数,使用FAP算法
算法实现：输入回声数据和参考数据，变换成8K数据率，经过回声抵消后输出8K的数据
          給G711编码。FAP+子带算法
引用全局变量：
输入参数说明： 
			   pEchoBuf  --采集回声数据指针，8K,单声道
               pAecBuf   --回声抵消输出，	 8K,单声道
               pSubHandle--回声抵消句柄，
		   
返 回 值：AEC_FAP_OK，成功
          AEC_FAP_ERR，失败
=============================================================================*/
int EchoCancelG71(void *pSubHandle,short *pEchoBuf,short *pAecBuf);

/*====================================================================
函数名	AecG711RefSet
功能    ：一幀G711的回声抵消参考数据写入缓冲区。8K
使用算法：112点的低通滤波，
参数说明：pRefBuf：一幀参考数据，
		  pSubHandle,AEC句柄
		  int bMute,输入是否静音
		  int bOutStereo，输出是否立体声
返回值说明：AEC_FAP_OK，成功
            AEC_FAP_ERR，失败

----------------------------------------------------------------------
====================================================================*/
int	AecG711RefSet(void *pSubHandle,short *pRefBuf,int bMute,int bOutStereo);


/*=============================================================================
函 数 名： EchoCancelG72
功    能：用于G722的回声抵消函数,使用FAP算法
算法实现：输入回声数据和参考数据，变换成8K数据率，经过回声抵消后输出8K的数据
          給G722编码。FAP+子带算法
引用全局变量：
输入参数说明： pEchoBuf  --采集回声数据指针，8K,单声道数据长度为AEC_G72_BUF_LENGTH/2
               pAecBuf   --回声抵消输出，	 8K,单声道
               pSubHandle--回声抵消句柄，	 
返 回 值：AEC_FAP_OK，成功
          AEC_FAP_ERR，失败
=============================================================================*/
int EchoCancelG72(void *pSubHandle,short *pEchoBuf,short *pAecBuf);

/*====================================================================
函数名	AecG722RefSet
功能    ：一幀G722的回声抵消参考数据写入缓冲区。8K
使用算法：
参数说明：pRefBuf：一幀参考数据，数据长度为AEC_G72_BUF_LENGTH/2 288点
		  pSubHandle,AEC句柄
		  int bOutStereo:输出是否双声道
返回值说明：AEC_FAP_OK，成功
            AEC_FAP_ERR，失败
			int bOutStereo, 输出是否双声道
----------------------------------------------------------------------
====================================================================*/
int	AecG722RefSet(void *pSubHandle,short *pRefBuf,int bMute,int bOutStereo);
#endif	//_aec_fap_h

