/*****************************************************************************
模   块   名: 计算音频编解码器信噪比模块
文   件   名: psnr.c
相 关  文 件: 
文件实现功能: 计算音频编解码器信噪比
版        本: V1.0  Copyright(C) 2005-2007 KDC, All rights reserved.
-----------------------------------------------------------------------------
修 改 记 录:
日       期      版本        修改人      修改内容
2005/06/22       1.0         宋  兵      创    建
******************************************************************************/
#ifndef PSNR_H
#define PSNR_H

#define MAX_FRAME_LEN      240

s16 s16SNR_Audio(s16 *ps16Source, s16 *ps16Synthesis, s16 s16FrameLen);

#endif
