/******************************************************************************
Ä£¿éÃû	    £ºH264¹«¹²¿âº¯Êı¿â
Ïà¹ØÎÄ¼ş	£º
ÎÄ¼şÊµÏÖ¹¦ÄÜ£ºÉùÃ÷Ò»Ğ©¾­¹ıÓÅ»¯ÁËµÄº¯ÊıµÄÔ­ĞÍ¡£
              ÎªÁËÔÚPCºÍEQUATORÆ½Ì¨ÉÏ×î´óÏŞ¶ÈµÄ¹²Ïí´úÂë£¬±ÜÃâÎ¬»¤Win32ºÍEquator
              Á½¸ö³ÌĞò°æ±¾£¬ÕâÀï²ÉÓÃÔ¤´¦ÀíÇø±ğ²»Í¬Æ½Ì¨ÉÏµÄº¯Êı¡£ÔÚµ÷ÓÃ³ÌĞòÖĞÖ»Ğè
              Ğ´º¯ÊıÃûµÄÖ÷Ìå£¬¾ßÌåµ÷ÓÃÊ²Ã´Æ½Ì¨ÉÏµÄº¯ÊıÓÉ±àÒëÆ÷×Ô¶¯Ñ¡Ôñ¡£Ô¤´¦ÀíÊÇ
              ÕâÑù×öµÄ£º
              ¸ù¾İËüµÄÈ¡ÖµÇø·Ö²»Í¬Æ½Ì¨£º
                      MAP_CODE:ÔÚEQUATORÆ½Ì¨ÉÏÓÅ»¯
			          DM642_CODE_TI:TI DM642µÄÓÅ»¯	
			          C_CODE£ºCÓïÑÔ°æ±¾
---------------------------------------------------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼:
  ÈÕ  ÆÚ	      °æ±¾	    	ĞŞ¸ÄÈË		ĞŞ¸ÄÄÚÈİ
2005.10.28        1.0           ºúĞ¡Åô       ´´½¨
2006.03.09        1.1           ºúĞ¡Åô       ĞŞ¸Ä    Ôö¼ÓTIÆ½Ì¨£¬È¥µôIA,blackfinÆ½Ì¨
2006.05.16        1.2           ºúĞ¡Åô       ĞŞ¸Ä    ¸Ä±äºê¶¨Òå
******************************************************************************/

#ifndef _H264F_LIB_H_
#define _H264F_LIB_H_

#include <stdio.h>
#include <string.h>
#include "algorithmtype.h"

#ifdef _MSC_VER
	//warning C4206: nonstandard extension used : translation unit is empty
	#pragma warning(disable : 4206)
#endif//_MSC_VER

//H264LIB °æ±¾ºÅ
#define VER_VCC	(const char*)"h264flib.36.36.01.00.051031"


#if defined __cplusplus
extern "C" { /* Begin "C" */
/* Intrinsics use C name-mangling.
 */
#endif /* __cplusplus */

#if  defined(MAP_CODE) //ÔÚEQUATORÉÏÓÅ»¯   /* OPTIMIZE_FOR */

/*====================================================================
º¯ÊıÃû       :  SAD8x8_map
¹¦ÄÜ         £º 8x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD8x8_map(u8 *pu8CurrMB, u16 u16CurrStride, u8 *pu8RefMB, u16 u16RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x16_map
¹¦ÄÜ         £º 16x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD16x16_map(u8 *pu8CurrMB, u16 u16CurrStride, u8 *pu8RefMB, u16 u16RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x8_map
¹¦ÄÜ         :  16x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD16x8_map(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD8x16_map
¹¦ÄÜ         :  8x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD8x16_map(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  PixAvg16x16_map
¹¦ÄÜ         :  Á½¸ö16x16¿éµÄÏñËØÆ½¾ù 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void PixAvg16x16_map(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x8_map
¹¦ÄÜ         :  UV·ÖÁ¿8x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x8_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x4_map
¹¦ÄÜ         :  UV·ÖÁ¿8x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x4_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x8_map
¹¦ÄÜ         :  UV·ÖÁ¿4x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x8_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x4_map
¹¦ÄÜ         :  UV·ÖÁ¿4x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x4_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  Sub8x8_map
¹¦ÄÜ         :  8x8¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub8x8_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  Sub4x4_map
¹¦ÄÜ         :  4x4¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub4x4_map(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  H264DCT16x16_map
¹¦ÄÜ         :  16x16¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT16x16_map(s16 * ps16Block);

/*====================================================================
º¯ÊıÃû       :  H264DCT8x8_map
¹¦ÄÜ         :  8x8¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT8x8_map(s16 *ps16Block);

/*====================================================================
º¯ÊıÃû       :  AddiDCT16x16_map
¹¦ÄÜ         :  16x16¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT16x16_map(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT8x8_map
¹¦ÄÜ         :  8x8¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT8x8_map(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT4x4_map
¹¦ÄÜ         :  4x4¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT4x4_map(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  H264Quant16x16_map
¹¦ÄÜ         :  ÊµÏÖ16x16¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Quant16x16_map(s16 *ps16InCoeff, s16 *ps16OutCoeff, u32 u32Quant, l32 l32SliceType);

/*====================================================================
º¯ÊıÃû       :  H264Quant8x8_map
¹¦ÄÜ         :  ÊµÏÖ8x8¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Quant8x8_map(s16 *ps16InCoeff, s16 *ps16OutCoeff, u32 u32Quant, l32 l32SliceType);

/*====================================================================
º¯ÊıÃû       :  H264Dequant16x16_map
¹¦ÄÜ         :  ÊµÏÖ16x16¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Dequant16x16_map(s16 *ps16InCoeff, s16 *ps16OutCoeff, u32 u32Quant);

/*====================================================================
º¯ÊıÃû       :  H264Dequant8x8_map
¹¦ÄÜ         :  ÊµÏÖ8x8¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Dequant8x8_map(s16 *ps16InCoeff, s16 *ps16OutCoeff, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º DctandQuant16x16_map
¹¦    ÄÜ£º 16x16¿éDCT±ä»»ºÍÁ¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCT±ä»»ÏµÊı
           pu8Src          Ô´Í¼Ïñ
           l32SrcStride    Ô´Í¼Ïñ¿í¶È
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
           u32IsIntra      ÊÇ·ñIntra±àÂë
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264DctandQuant16x16_map(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct, const u32 u32Quant, u32 u32IsIntra);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant16x16_map
¹¦    ÄÜ£º 16x16·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant16x16_map(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant8x8_map
¹¦    ÄÜ£º 8x8·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ 
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant8x8_map(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º iDCTandiQuant4x4_map
¹¦    ÄÜ£º 4x4¿é·´DCT·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant4x4_map(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º SubDCT8x8_map
¹¦    ÄÜ£º 8x8¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT8x8_map(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º SubDCT16x16_map
¹¦    ÄÜ£º 16x16¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT16x16_map(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º interpolate16x16_vc_map
¹¦    ÄÜ£º 16x16¿é°ëÏñËØ´¹Ö±ÃæºÍÖĞĞÄÃæ²åÖµ
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src           Ô´Í¼ÏñÖ¸Õë
           l32SrcStride     Ô´Í¼Ïñ¿í¶È
           pu8DstV          ´¹Ö±ÃæÍ¼ÏñÖ¸Õë
           pu8DstC          ÖĞĞÄÃæÍ¼ÏñÖ¸Õë
           l32DstStride     Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void Intp6TapHalfPelVC16x16_map(u8* pu8Src, l32 l32SrcStride, u8* pu8DstV, u8* pu8DstC, l32 l32DstStride);

void Intp6TapHalfPelALL16x16_map(u8 *pu8Src, u8 *pu8DstH, u8 *pu8DstV, u8 *pu8DstC, u16 u16Stride);

//predict

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Horz_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Horz_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Vert_map
¹¦    ÄÜ: Intra16x16ÁÁ¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Vert_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Plane_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Plane_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCLeft_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCLeft_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCTop_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCTop_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC128_map
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC128_map(u8* pu8Dst, l32 l32DstStride);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Horz_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Horz_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Vert_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Vert_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Plane_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Plane_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCLeft_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCLeft_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCTop_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCTop_map(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC128_map
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC128_map(u8* pu8Dst, l32 l32DstStride);

l32 H264CoeffCost16_map(s16* ps16Coeff);

l32 H264CoeffCost15_map(s16* ps16Coeff);

void MemCopy16x16_map(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy16x8_map(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x16_map(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x8_map(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

u32 Deviation16x16_map(const u8* pu8Cur, l32 l32Stride);


#define MemCopy16x16 MemCopy16x16_map

#define MemCopy16x8 MemCopy16x8_map

#define MemCopy8x16 MemCopy8x16_map

#define MemCopy8x8 MemCopy8x8_map

#define Deviation16x16 Deviation16x16_map

#define SAD8x8 SAD8x8_map

#define SAD16x16 SAD16x16_map

#define SAD16x8 SAD16x8_map

#define SAD8x16 SAD8x16_map

#define PixAvg16x16 PixAvg16x16_map

#define McUVEighthPix8x8 McUVEighthPix8x8_map

#define McUVEighthPix8x4 McUVEighthPix8x4_map

#define McUVEighthPix4x8 McUVEighthPix4x8_map

#define McUVEighthPix4x4 McUVEighthPix4x4_map

#define Sub8x8 Sub8x8_map

#define H264DCT16x16 H264DCT16x16_map

#define H264DCT8x8 H264DCT8x8_map

#define H264AddiDCT16x16 H264AddiDCT16x16_map

#define H264AddiDCT8x8 H264AddiDCT8x8_map

#define H264AddiDCT4x4 H264AddiDCT4x4_map

#define H264Quant16x16 H264Quant16x16_map

#define H264Quant8x8 H264Quant8x8_map

#define H264Dequant16x16 H264Dequant16x16_map

#define H264Dequant8x8 H264Dequant8x8_map

#define H264DctandQuant16x16 H264DctandQuant16x16_map

#define H264AddiDCTiQuant16x16 H264AddiDCTiQuant16x16_map

#define H264AddiDCTiQuant8x8 H264AddiDCTiQuant8x8_map

#define H264AddiDCTiQuant4x4 H264AddiDCTiQuant4x4_map

#define H264SubDCT8x8 H264SubDCT8x8_map

#define H264SubDCT16x16 H264SubDCT16x16_map

//predict

#define H264IntraPredict16x16Horz H264IntraPredict16x16Horz_map

#define H264IntraPredict16x16Vert H264IntraPredict16x16Vert_map

#define H264IntraPredict16x16DC H264IntraPredict16x16DC_map

#define H264IntraPredict16x16Plane H264IntraPredict16x16Plane_map

#define H264IntraPredict16x16DCLeft H264IntraPredict16x16DCLeft_map

#define H264IntraPredict16x16DCTop H264IntraPredict16x16DCTop_map

#define H264IntraPredict16x16DC128 H264IntraPredict16x16DC128_map

#define H264IntraPredict8x8Horz H264IntraPredict8x8Horz_map

#define H264IntraPredict8x8Vert H264IntraPredict8x8Vert_map

#define H264IntraPredict8x8DC H264IntraPredict8x8DC_map

#define H264IntraPredict8x8Plane H264IntraPredict8x8Plane_map

#define H264IntraPredict8x8DCLeft H264IntraPredict8x8DCLeft_map

#define H264IntraPredict8x8DCTop H264IntraPredict8x8DCTop_map

#define H264IntraPredict8x8DC128 H264IntraPredict8x8DC128_map

#define Intp6TapHalfPelVC16x16 Intp6TapHalfPelVC16x16_map

#define Intp6TapHalfPelALL16x16 Intp6TapHalfPelALL16x16_map

#define H264CoeffCost15 H264CoeffCost15_map

#define H264CoeffCost16 H264CoeffCost16_map

#elif defined(DM642_CODE)     //ÔÚTIÉÏÓÅ»¯

/*====================================================================
º¯ÊıÃû       :  SAD8x8_ti
¹¦ÄÜ         £º 8x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD8x8_ti(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x16_ti
¹¦ÄÜ         £º 16x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD16x16_ti(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x8_ti
¹¦ÄÜ         :  16x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD16x8_ti(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD8x16_ti
¹¦ÄÜ         :  8x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD8x16_ti(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);


/*====================================================================
º¯ÊıÃû       :  SAD_ti
¹¦ÄÜ         £º Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ : u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë£¨8×Ö½Ú¶ÔÆë£©
               u16  l32CurrStride £ºµ±Ç°ºê¿é²½³¤
               u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
               u16  l32RefStride  £º²Î¿¼ºê¿é²½³¤
               l32       l32Width : ¿é¿í¶È£¨Îª8µÄ±¶Êı£©
               l32       l32Height: ¿é¸ß¶È £¨Îª8µÄ±¶Êı£©
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼:
ÈÕÆÚ£º       °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ      
======================================================================*/
u32 SAD_ti(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride, l32 l32Width, l32 l32Height);

/*====================================================================
º¯ÊıÃû       :  PixAvgSad16x16_ti
¹¦ÄÜ         :  Á½¸ö16x16¿éµÄÏñËØÆ½¾ù£¬ÔÙ×öSAD£¬ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë£¬(²Î¿¼Í¼ÏñÖ¸Õë)
                u8 *pu8Cur         £ºÔ´Í¼ÏñÖ¸Õë Ö¸Õë
·µ»ØÖµËµÃ÷   :  16x16¿éSADÖµ
ÌØÊâËµÃ÷     :  ²Î¿¼Í¼ÏñÖ¸ÕëºÍÔ´Í¼ÏñÖ¸ÕëµÄstrideÎª16
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 PixAvgSad16x16_ti(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, u8 *pu8Cur);

/*====================================================================
º¯ÊıÃû       :  PixAvg_ti
¹¦ÄÜ         :  Á½¸ö¿éµÄÏñËØÆ½¾ù 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                l32 l32Width : ¿é¿í¶È£¨Îª8µÄ±¶Êı£©
                l32 l32Height: ¿é¸ß¶È £¨Îª8µÄ±¶Êı£©
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ²Î¿¼Í¼ÏñÖ¸ÕëºÍÔ´Í¼ÏñÖ¸ÕëµÄstrideÎª16
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void PixAvg_ti(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, l32 l32DstStride, l32 l32Width, l32 l32Height);

/*====================================================================
º¯ÊıÃû       :  PixAvg16x16_c
¹¦ÄÜ         :  Á½¸ö16x16¿éµÄÏñËØÆ½¾ù 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë, ²»±£Ö¤8×Ö½Ú¶ÔÆë
                l32 l32Src1Stride  £ºÔ´¿é1²½³¤£¬²»±£Ö¤8×Ö½Ú¶ÔÆë
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                l32 l32Src2Stride  £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë£¬(²Î¿¼Í¼ÏñÖ¸Õë£©  ±£Ö¤8×Ö½Ú¶ÔÆë
                l32 l32DstStride   £ºÄ¿±ê²½³¤
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ²Î¿¼Í¼ÏñÖ¸ÕëºÍÔ´Í¼ÏñÖ¸ÕëµÄstrideÎª16
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º       °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void PixAvg16x16_ti(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, l32 l32DstStride);


/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x8_ti
¹¦ÄÜ         :  UV·ÖÁ¿8x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x8_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x4_ti
¹¦ÄÜ         :  UV·ÖÁ¿8x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x4_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x8_ti
¹¦ÄÜ         :  UV·ÖÁ¿4x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x8_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x4_ti
¹¦ÄÜ         :  UV·ÖÁ¿4x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x4_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  Sub8x8_ti
¹¦ÄÜ         :  8x8¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub8x8_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  Sub4x4_ti
¹¦ÄÜ         :  4x4¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub4x4_ti(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  H264DCT16x16_ti
¹¦ÄÜ         :  16x16¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT16x16_ti(s16 * ps16Block);

/*====================================================================
º¯ÊıÃû       :  H264DCT8x8_ti
¹¦ÄÜ         :  8x8¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT8x8_ti(s16 *ps16Block);

/*====================================================================
º¯ÊıÃû       :  AddiDCT16x16_ti
¹¦ÄÜ         :  16x16¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT16x16_ti(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT8x8_ti
¹¦ÄÜ         :  8x8¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT8x8_ti(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT4x4_ti
¹¦ÄÜ         :  4x4¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT4x4_ti(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  H264Quant16x16_ti
¹¦ÄÜ         :  ÊµÏÖ16x16¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Quant16x16_ti(s16 *ps16Dct, u32 u32Quant, l32 l32IsIntra);

/*====================================================================
º¯ÊıÃû       :  H264Quant8x8_ti
¹¦ÄÜ         :  ÊµÏÖ8x8¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
//void H264Quant8x8_ti(s16 *ps16Dct, u32 u32Quant, l32 l32IsIntra);
void H264Quant8x8_ti(s16 *ps16Dct, l32 l32QPconst, s16 s16QPBits, s16 *ps16QPQuant);

/*====================================================================
º¯ÊıÃû       :  H264Dequant16x16_ti
¹¦ÄÜ         :  ÊµÏÖ16x16¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Dequant16x16_ti(s16 *ps16Dct, u32 u32Quant);

/*====================================================================
º¯ÊıÃû       :  H264Dequant8x8_ti
¹¦ÄÜ         :  ÊµÏÖ8x8¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
//void H264Dequant8x8_ti(s16 *ps16Dct, u32 u32Quant);
void H264Dequant8x8_ti(s16 *ps16Dct, s16 s16QPper, s16 *ps16Dequant);

void Hadamard4x4_ti(s16* ps16DctDC);

void Hadamard2x2_ti(s16* ps16DctDC);

void IHadamard4x4_ti(s16* ps16DctDC);

void IHadamard2x2_ti(s16* ps16DctDC);

void H264DCQuant4x4_ti(s16* ps16DctDC, const u32 u32QP);

void H264DCQuant2x2_ti(s16* ps16DctDC, const u32 u32QP, u32 u32IsIntra);

void H264DCDequant4x4_ti(s16* ps16DctDC, const u32 u32QP);

void H264DCDequant2x2_ti(s16* ps16DctDC, const u32 u32QP);

/*=============================================================================
º¯ Êı Ãû£º DctandQuant16x16_ti
¹¦    ÄÜ£º 16x16¿éDCT±ä»»ºÍÁ¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCT±ä»»ÏµÊı
           pu8Src          Ô´Í¼Ïñ
           l32SrcStride    Ô´Í¼Ïñ¿í¶È
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
           u32IsIntra      ÊÇ·ñIntra±àÂë
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264DctandQuant16x16_ti(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct, const u32 u32Quant, u32 u32IsIntra);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant16x16_ti
¹¦    ÄÜ£º 16x16·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant16x16_ti(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant8x8_ti
¹¦    ÄÜ£º 8x8·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ 
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant8x8_ti(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º iDCTandiQuant4x4_ti
¹¦    ÄÜ£º 4x4¿é·´DCT·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant4x4_ti(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º SubDCT8x8_ti
¹¦    ÄÜ£º 8x8¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT8x8_ti(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º SubDCT16x16_ti
¹¦    ÄÜ£º 16x16¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT16x16_ti(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º interpolate16x16_vc_ti
¹¦    ÄÜ£º 16x16¿é°ëÏñËØ´¹Ö±ÃæºÍÖĞĞÄÃæ²åÖµ
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src           Ô´Í¼ÏñÖ¸Õë
           l32SrcStride     Ô´Í¼Ïñ¿í¶È
           pu8DstV          ´¹Ö±ÃæÍ¼ÏñÖ¸Õë
           pu8DstC          ÖĞĞÄÃæÍ¼ÏñÖ¸Õë
           l32DstStride     Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void Intp6TapHalfPelVC16x16_ti(u8* pu8Src, l32 l32SrcStride, u8* pu8DstV, u8* pu8DstC, l32 l32DstStride);

void Intp6TapHalfPelAll16x16_ti(u8 *pu8Src, u8 *pu8DstH, u8 *pu8DstV, u8 *pu8DstC, u16 u16Stride);
//predict

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Horz_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Horz_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Vert_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Vert_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Plane_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Plane_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCLeft_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCLeft_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCTop_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCTop_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC128_ti
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC128_ti(u8* pu8Dst, l32 l32DstStride);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Horz_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Horz_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Vert_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Vert_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Plane_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Plane_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCLeft_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCLeft_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCTop_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCTop_ti(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC128_ti
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC128_ti(u8* pu8Dst, l32 l32DstStride);


l32 H264CoeffCost16_ti(s16* ps16Coeff);

l32 H264CoeffCost15_ti(s16* ps16Coeff);

void MemCopy16x16_ti(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy16x8_ti(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x16_ti(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x8_ti(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy_ti(void* pDst, const void* pSrc, l32 l32Size);

void MemSet_ti(void* pDst, const l32 l32Src, l32 l32Size);

u32 Deviation16x16_ti(const u8* pu8Cur, l32 l32Stride);

l32 Clip3_ti(l32 l32A, l32 l32Low, l32 l32High);

l32 GetMedian_ti(l32 l32X, l32 l32Y, l32 l32Z);

u32 ArrayNonZeroCount4_ti(s16* ps16V);

u32 ArrayNonZeroCount8_ti(s16* ps16V);

u32 ArrayNonZeroCount16_ti(s16* ps16V);

void ScanZigzag16x16_ti(s16 ps16Zig[16][4 * 4], s16* ps16Dct);

void ScanZigzag8x8_ti(s16* ps16Zig, s16* ps16Dct);

void ScanZigzag4x4_ti(s16* ps16Zig, s16* ps16Dct);

void ScanZigzag2x2_ti(s16* ps16Zig, s16* ps16Dct);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_01_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(aµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_01_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_03_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(cµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_03_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPelV4x4_10_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(dµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_10_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_11_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(eµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_11_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_12_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(fµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_12_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_13_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(gµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_13_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_21_ti
¦Ü         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(iµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_21_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_23_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(kµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_23_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_30_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(nµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_30_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_31_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(pµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_31_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_32_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(qµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_32_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_33_ti
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(rµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_33_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_01_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(aµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_01_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_03_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(cµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_03_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPelV8x8_10_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(dµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_10_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_11_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(eµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_11_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_12_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(fµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_12_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_13_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(gµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_13_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_21_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(iµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_21_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_23_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(kµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_23_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);


/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_30_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(nµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_30_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_31_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(pµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_31_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_32_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(qµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_32_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_33_ti
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(rµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_33_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);


/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelH4x4_ti
¹¦ÄÜ         £º 4x4¿éµÄË®Æ½·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelH4x4_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelV4x4_ti
¹¦ÄÜ         £º 4x4¿éµÄ´¹Ö±·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelV4x4_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelHV4x4_ti
¹¦ÄÜ         £º 4x4¿éµÄ¶Ô½Ç·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelHV4x4_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelH8x8_ti
¹¦ÄÜ         £º 8x8¿éµÄË®Æ½·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelH8x8_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelV8x8_ti
¹¦ÄÜ         £º 8x8¿éµÄ´¹Ö±·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16       *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelV8x8_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelHV8x8_ti
¹¦ÄÜ         £º 8x8¿éµÄ¶Ô½Ç·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelHV8x8_ti(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
	º¯ÊıÃû	    :	H264ACDequant4x4_ti
	¹¦ÄÜ		:	ÊµÏÖ 4x4 AC¿éµÄ·´Á¿»¯
	Ëã·¨ÊµÏÖ	:	(¿ÉÑ¡Ïî)
	ÒıÓÃÈ«¾Ö±äÁ¿:	ÎŞ
    ÊäÈë²ÎÊıËµÃ÷:	s16 *ps16InCoeff	:Òª·´Á¿»¯µÄÏµÊı¾ØÕó
					s16 *ps16OutCoeff	:Êä³ö½á¹û
					u32 u32Quant			:Á¿»¯ÏµÊı£¬
	·µ»ØÖµËµÃ÷  :	ÎŞ
====================================================================*/
void H264ACDequant4x4_ti(s16 *ps16DCTIn, s16 *ps16DCTOut, u32 u32Quant);

void H264ACQuant4x4_ti(s16 *ps16DCT, u8 u8Quant, l32 l32IsIntra);
/*====================================================================
	º¯ÊıÃû	    :	H264Dequant4x4_ti
	¹¦ÄÜ		:	ÊµÏÖ 4x4 ¿éµÄ·´Á¿»¯
	Ëã·¨ÊµÏÖ	:	(¿ÉÑ¡Ïî)
	ÒıÓÃÈ«¾Ö±äÁ¿:	ÎŞ
    ÊäÈë²ÎÊıËµÃ÷:	s16 *ps16InCoeff	:Òª·´Á¿»¯µÄÏµÊı¾ØÕó£¬
					s16 *ps16OutCoeff	:Êä³ö½á¹û
					u8  u32Quant			:Á¿»¯ÏµÊı£¬
	·µ»ØÖµËµÃ÷  :	ÎŞ
====================================================================*/
void H264Dequant4x4_ti(s16 *ps16DCTIn, s16 *ps16DCTOut, u32 u32Quant);

void H264Quant4x4_ti(s16 *ps16DCT, u8 u8Quant, l32 l32IsIntra);


//4x4 1/4ÏñËØ²åÖµ
#define IntpQuarterPel4x4_01		IntpQuarterPel4x4_01_ti
#define IntpQuarterPel4x4_03		IntpQuarterPel4x4_03_ti
#define IntpQuarterPel4x4_10		IntpQuarterPel4x4_10_ti
#define IntpQuarterPel4x4_11		IntpQuarterPel4x4_11_ti
#define IntpQuarterPel4x4_12		IntpQuarterPel4x4_12_ti
#define IntpQuarterPel4x4_13		IntpQuarterPel4x4_13_ti
#define IntpQuarterPel4x4_21		IntpQuarterPel4x4_21_ti
#define IntpQuarterPel4x4_23		IntpQuarterPel4x4_23_ti
#define IntpQuarterPel4x4_30		IntpQuarterPel4x4_30_ti
#define IntpQuarterPel4x4_31		IntpQuarterPel4x4_31_ti
#define IntpQuarterPel4x4_32		IntpQuarterPel4x4_32_ti
#define IntpQuarterPel4x4_33		IntpQuarterPel4x4_33_ti

//4x4 6Tap °ëÏñËØ²åÖµ
#define Intp6TapHalfPelH4x4		    Intp6TapHalfPelH4x4_ti
#define Intp6TapHalfPelV4x4		    Intp6TapHalfPelV4x4_ti
#define Intp6TapHalfPelHV4x4		Intp6TapHalfPelHV4x4_ti

//8x8 1/4ÏñËØ²åÖµ
#define IntpQuarterPel8x8_01		IntpQuarterPel8x8_01_ti
#define IntpQuarterPel8x8_03		IntpQuarterPel8x8_03_ti
#define IntpQuarterPel8x8_10		IntpQuarterPel8x8_10_ti
#define IntpQuarterPel8x8_11		IntpQuarterPel8x8_11_ti
#define IntpQuarterPel8x8_12		IntpQuarterPel8x8_12_ti
#define IntpQuarterPel8x8_13		IntpQuarterPel8x8_13_ti
#define IntpQuarterPel8x8_21		IntpQuarterPel8x8_21_ti
#define IntpQuarterPel8x8_23		IntpQuarterPel8x8_23_ti
#define IntpQuarterPel8x8_30		IntpQuarterPel8x8_30_ti
#define IntpQuarterPel8x8_31		IntpQuarterPel8x8_31_ti
#define IntpQuarterPel8x8_32		IntpQuarterPel8x8_32_ti
#define IntpQuarterPel8x8_33		IntpQuarterPel8x8_33_ti

//8x8 6Tap °ëÏñËØ²åÖµ
#define Intp6TapHalfPelH8x8		    Intp6TapHalfPelH8x8_ti
#define Intp6TapHalfPelV8x8		    Intp6TapHalfPelV8x8_ti
#define Intp6TapHalfPelHV8x8		Intp6TapHalfPelHV8x8_ti

#define MemCopy16x16 MemCopy16x16_ti

#define MemCopy16x8 MemCopy16x8_ti

#define MemCopy8x16 MemCopy8x16_ti

#define MemCopy8x8 MemCopy8x8_ti

#define MemCopy MemCopy_ti 

#define MemSet MemSet_ti

#define H264Deviation16x16 Deviation16x16_ti

#define H264SAD16x8 SAD16x8_ti

#define H264SAD8x16 SAD8x16_ti

#define H264SAD SAD_ti

#define H264SAD8x8 SAD8x8_ti

#define H264SAD16x16Linar SAD16x16_ti

#define H264SAD16x16 SAD16x16_ti

#define PixelAvgSad16x16 PixAvgSad16x16_ti

#define PixelAverage PixAvg_ti

#define PixelAverage16x16 PixAvg16x16_ti

#define EighthPelMCChroma8x8 McUVEighthPix8x8_ti

#define EighthPelMCChroma8x4 McUVEighthPix8x4_ti

#define EighthPelMCChroma4x8 McUVEighthPix4x8_ti

#define EighthPelMCChroma4x4 McUVEighthPix4x4_ti

#define H264DCT16x16 H264DCT16x16_ti

#define H264DCT8x8 H264DCT8x8_ti

#define H264DCT2x2DC            Hadamard2x2_ti
#define H264Quant2x2DC          H264DCQuant2x2_ti
#define H264iDCT2x2DC           IHadamard2x2_ti
#define H264iQuant2x2DC         H264DCDequant2x2_ti
#define H264DCT4x4DC            Hadamard4x4_ti
#define H264iDCT4x4DC           IHadamard4x4_ti
#define H264Quant4x4DC          H264DCQuant4x4_ti
#define H264iQuant4x4DC         H264DCDequant4x4_ti
#define H264ACDequant4x4        H264ACDequant4x4_ti
#define H264ACQuant4x4          H264ACQuant4x4_ti
#define H264Dequant4x4          H264Dequant4x4_ti
#define H264Quant4x4            H264Quant4x4_ti

#define H264AddiDCT16x16 H264AddiDCT16x16_ti

#define H264AddiDCT8x8 H264AddiDCT8x8_ti

#define H264AddiDCT4x4 H264AddiDCT4x4_ti

#define H264Quant16x16 H264Quant16x16_ti

#define H264Quant8x8 H264Quant8x8_ti

#define H264iQuant16x16 H264Dequant16x16_ti

#define H264iQuant8x8 H264Dequant8x8_ti


#define H264SubDCTandQuant16x16 H264DctandQuant16x16_ti

#define H264AddiDCTandiQuant16x16 H264AddiDCTiQuant16x16_ti

#define H264AddiDCTadniQuant8x8 H264AddiDCTiQuant8x8_ti

#define H264AddiDCTiQuant4x4 H264AddiDCTiQuant4x4_ti

#define H264SubDCT8x8 H264SubDCT8x8_ti

#define H264SubDCT16x16 H264SubDCT16x16_ti

//encoder intrapredict

#define H264IntraPredict16x16Horz H264IntraPredict16x16Horz_ti

#define H264IntraPredict16x16Vert H264IntraPredict16x16Vert_ti

#define H264IntraPredict16x16DC H264IntraPredict16x16DC_ti

#define H264IntraPredict16x16Plane H264IntraPredict16x16Plane_ti

#define H264IntraPredict16x16DCLeft H264IntraPredict16x16DCLeft_ti

#define H264IntraPredict16x16DCTop H264IntraPredict16x16DCTop_ti

#define H264IntraPredict16x16DC128 H264IntraPredict16x16DC128_ti

#define H264IntraPredict8x8Horz H264IntraPredict8x8Horz_ti

#define H264IntraPredict8x8Vert H264IntraPredict8x8Vert_ti

#define H264IntraPredict8x8DC H264IntraPredict8x8DC_ti

#define H264IntraPredict8x8Plane H264IntraPredict8x8Plane_ti

#define H264IntraPredict8x8DCLeft H264IntraPredict8x8DCLeft_ti

#define H264IntraPredict8x8DCTop H264IntraPredict8x8DCTop_ti

#define H264IntraPredict8x8DC128 H264IntraPredict8x8DC128_ti

#define HalfInterpolate16x16 Intp6TapHalfPelAll16x16_ti 

#define H264CoeffCost15 H264CoeffCost15_ti

#define H264CoeffCost16 H264CoeffCost16_ti

#define Clip3                   Clip3_ti

#define GetMedian               GetMedian_ti

#define ArrayNonZeroCount4      ArrayNonZeroCount4_ti

#define ArrayNonZeroCount8      ArrayNonZeroCount8_ti

#define ArrayNonZeroCount16     ArrayNonZeroCount16_ti

#define ScanZigzag16x16         ScanZigzag16x16_ti

#define ScanZigzag8x8           ScanZigzag8x8_ti

#define ScanZigzag4x4           ScanZigzag4x4_ti

#define ScanZigzag2x2           ScanZigzag2x2_ti

#elif defined(C_CODE)     //C´úÂë

/*====================================================================
º¯ÊıÃû       :  SAD8x8_c
¹¦ÄÜ         £º 8x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD8x8_c(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x16_c
¹¦ÄÜ         £º 16x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                 u16  u16CurrStride  £ºµ±Ç°ºê¿é²½³¤
                 u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                 u16  u16RefStride   £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   £º µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
2005-3-28   1.0          ÕÅ¿ûÑô      ÓÅ»¯
======================================================================*/
u32 SAD16x16_c(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD16x8_c
¹¦ÄÜ         :  16x8Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD16x8_c(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD8x16_c
¹¦ÄÜ         :  8x16Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë
                u16  u16CurrStride £ºµ±Ç°ºê¿é²½³¤
                u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
                u16  u16RefStride  £º²Î¿¼ºê¿é²½³¤
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 SAD8x16_c(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride);

/*====================================================================
º¯ÊıÃû       :  SAD_c
¹¦ÄÜ         £º Ä£¿éSAD 
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ : u8  *pu8CurrMB     £ºµ±Ç°ºê¿éÖ¸Õë£¨8×Ö½Ú¶ÔÆë£©
               u16  l32CurrStride £ºµ±Ç°ºê¿é²½³¤
               u8  *pu8RefMB      £º²Î¿¼ºê¿éÖ¸Õë
               u16  l32RefStride  £º²Î¿¼ºê¿é²½³¤
               l32       l32Width : ¿é¿í¶È£¨Îª8µÄ±¶Êı£©
               l32       l32Height: ¿é¸ß¶È £¨Îª8µÄ±¶Êı£©
·µ»ØÖµËµÃ÷   :  µ±Ç°ºê¿éÓë²Î¿¼ºê¿éÖ®²î¾ø¶ÔÖµµÄºÍ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼:
ÈÕÆÚ£º       °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ      
======================================================================*/
u32 SAD_c(const u8 *pu8CurrMB, l32 l32CurrStride, const u8 *pu8RefMB, l32 l32RefStride, l32 l32Width, l32 l32Height);

/*====================================================================
º¯ÊıÃû       :  PixAvg16x16_c
¹¦ÄÜ         :  Á½¸ö16x16¿éµÄÏñËØÆ½¾ù 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void PixAvg16x16_c(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  PixAvgSad16x16_c
¹¦ÄÜ         :  Á½¸ö16x16¿éµÄÏñËØÆ½¾ù£¬ÔÙ×öSAD£¬ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë£¬(²Î¿¼Í¼ÏñÖ¸Õë)
                u8 *pu8Cur         £ºÔ´Í¼ÏñÖ¸Õë Ö¸Õë
·µ»ØÖµËµÃ÷   :  16x16¿éSADÖµ
ÌØÊâËµÃ÷     :  ²Î¿¼Í¼ÏñÖ¸ÕëºÍÔ´Í¼ÏñÖ¸ÕëµÄstrideÎª16
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
u32 PixAvgSad16x16_c(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, u8 *pu8Cur);

/*====================================================================
º¯ÊıÃû       :  PixAvg_c
¹¦ÄÜ         :  Á½¸ö¿éµÄÏñËØÆ½¾ù 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src1       £ºÔ´¿é1Ö¸Õë
                u16  u16Src1Stride £ºÔ´¿é1²½³¤
                u8  *pu8Src2       £ºÔ´¿é2Ö¸Õë
                u16  u16Src2Stride £ºÔ´¿é2²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                l32 l32Width : ¿é¿í¶È£¨Îª8µÄ±¶Êı£©
                l32 l32Height: ¿é¸ß¶È £¨Îª8µÄ±¶Êı£©
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ²Î¿¼Í¼ÏñÖ¸ÕëºÍÔ´Í¼ÏñÖ¸ÕëµÄstrideÎª16
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void PixAvg_c(u8 *pu8Src1, l32 l32Src1Stride, u8 *pu8Src2, l32 l32Src2Stride, u8 *pu8Dst, l32 l32DstStride, l32 l32Width, l32 l32Height);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x8_c
¹¦ÄÜ         :  UV·ÖÁ¿8x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x8_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix8x4_c
¹¦ÄÜ         :  UV·ÖÁ¿8x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix8x4_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x8_c
¹¦ÄÜ         :  UV·ÖÁ¿4x8¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾ÖäÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x8_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  McUVEighthPix4x4_c
¹¦ÄÜ         :  UV·ÖÁ¿4x4¿é1/8ÏñËØÔË¶¯²¹³¥ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤
                s16  s16Mvx        £ºÔË¶¯Ê¸Á¿x·ÖÁ¿
                s16  s16Mvy        £ºÔË¶¯Ê¸Á¿y·ÖÁ¿
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void McUVEighthPix4x4_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Dst, l32 l32DstStride, s16 s16Mvx, s16 s16Mvy);

/*====================================================================
º¯ÊıÃû       :  Sub8x8_c
¹¦ÄÜ         :  8x8¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub8x8_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  Sub4x4_c
¹¦ÄÜ         :  4x4¿é²Ğ²î 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                u16  u16SrcStride  £ºÔ´¿é²½³¤
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                s16 *ps16Dct       £º²Ğ²î¿éÖ¸Õë
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void Sub4x4_c(u8 *pu8Src, l32 l32SrcStride, u8 *pu8Pred, l32 l32PredStride, s16 *ps16Dct);

/*====================================================================
º¯ÊıÃû       :  H264DCT16x16_c
¹¦ÄÜ         :  16x16¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT16x16_c(s16 * ps16Block);

/*====================================================================
º¯ÊıÃû       :  H264DCT8x8_c
¹¦ÄÜ         :  8x8¿éDCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264DCT8x8_c(s16 *ps16Block);

/*====================================================================
º¯ÊıÃû       :  AddiDCT16x16_c
¹¦ÄÜ         :  16x16¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT16x16_c(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT8x8_c
¹¦ÄÜ         :  8x8¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT8x8_c(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  AddiDCT4x4_c
¹¦ÄÜ         :  4x4¿é·´DCT 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16Block     £º¿éÏµÊıÖ¸Õë
                u8  *pu8Pred       £ºÔ¤²â¿éÖ¸Õë
                l32  l32PredStride £ºÔ¤²â¿é²½³¤
                u8  *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                l32  l32DstStride  £ºÄ¿±ê¿é²½³¤                
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264AddiDCT4x4_c(s16* ps16Block, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, l32 l32DstStride);

/*====================================================================
º¯ÊıÃû       :  H264Quant16x16_c
¹¦ÄÜ         :  ÊµÏÖ16x16¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Quant16x16_c(s16 *ps16Dct, u32 u32Quant, l32 l32IsIntra);

/*====================================================================
º¯ÊıÃû       :  H264Quant8x8_c
¹¦ÄÜ         :  ÊµÏÖ8x8¿éÁ¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £ºÁ¿»¯ÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
                l32  l32SliceType  £ºSliceÀàĞÍ
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
//void H264Quant8x8_c(s16 *ps16Dct, u32 u32Quant, l32 l32IsIntra);
void H264Quant8x8_c(s16 *ps16Dct, l32 l32QPconst, s16 s16QPBits, s16 *ps16QPQuant);
/*====================================================================
º¯ÊıÃû       :  H264Dequant16x16_c
¹¦ÄÜ         :  ÊµÏÖ16x16¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
void H264Dequant16x16_c(s16 *ps16Dct, u32 u32Quant);

/*====================================================================
º¯ÊıÃû       :  H264Dequant8x8_c
¹¦ÄÜ         :  ÊµÏÖ8x8¿é·´Á¿»¯ 
ÒıÓÃÈ«¾Ö±äÁ¿ :  ÎŞ
ÊäÈë²ÎÊıËµÃ÷ :  s16 *ps16InCoeff   £º·´Á¿»¯µÄÏµÊı¾ØÕó
                s16 *ps16OutCoeff  £ºÊä³öÏµÊı¾ØÕó
                u8   u8Quant       £ºÁ¿»¯²ÎÊı
·µ»ØÖµËµÃ÷   :  ÎŞ
ÌØÊâËµÃ÷     :  ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ
======================================================================*/
//void H264Dequant8x8_c(s16 *ps16Dct, u32 u32Quant);
void H264Dequant8x8_c(s16 *ps16Dct, s16 s16QPper, s16 *ps16Dequant);

void Hadamard4x4_c(s16* ps16DctDC);

void Hadamard2x2_c(s16* ps16DctDC);

void IHadamard4x4_c(s16* ps16DctDC);

void IHadamard2x2_c(s16* ps16DctDC);

void H264DCQuant4x4_c(s16* ps16DctDC, const u32 u32QP);

void H264DCQuant2x2_c(s16* ps16DctDC, const u32 u32QP, u32 u32IsIntra);

void H264DCDequant4x4_c(s16* ps16DctDC, const u32 u32QP);

void H264DCDequant2x2_c(s16* ps16DctDC, const u32 u32QP);

/*=============================================================================
º¯ Êı Ãû£º DctandQuant16x16_c
¹¦    ÄÜ£º 16x16¿éDCT±ä»»ºÍÁ¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCT±ä»»ÏµÊı
           pu8Src          Ô´Í¼Ïñ
           l32SrcStride    Ô´Í¼Ïñ¿í¶È
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
           u32IsIntra      ÊÇ·ñIntra±àÂë
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264DctandQuant16x16_c(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct, const u32 u32Quant, u32 u32IsIntra);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant16x16_c
¹¦    ÄÜ£º 16x16·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant16x16_c(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º AddiDCTandiQuant8x8_c
¹¦    ÄÜ£º 8x8·´±ä»»·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ 
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant8x8_c(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º iDCTandiQuant4x4_c
¹¦    ÄÜ£º 4x4¿é·´DCT·´Á¿»¯
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º ps16Dct         DCTÏµÊı
           pu8Pred         Ô¤²âÍ¼Ïñ
           l32PredStride   Ô¤²âÍ¼Ïñ¿í¶È
           pu8Dst          Ä¿µÄÍ¼Ïñ
           l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
           u8Quant         Á¿»¯²ÎÊı
·µ »Ø Öµ£º ÎŞ
=============================================================================*/
void H264AddiDCTiQuant4x4_c(s16* ps16Dct, u8* pu8Pred, l32 l32PredStride, u8* pu8Dst, u32 l32DstStride, u32 u32Quant);

/*=============================================================================
º¯ Êı Ãû£º SubDCT8x8_c
¹¦    ÄÜ£º 8x8¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT8x8_c(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º SubDCT16x16_c
¹¦    ÄÜ£º 16x16¿édct
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src            Ô´Í¼ÏñÖ¸Õë
           l32SrcStride      Ô´Í¼Ïñ¿í¶È
           pu8Pred           Ô¤²âÍ¼ÏñÖ¸Õë
           l32PredStride     Ô¤²âÍ¼Ïñ¿í¶È
           ps16Dct           ²Ğ²îÍ¼ÏñÖ¸Õë
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void H264SubDCT16x16_c(u8* pu8Src, l32 l32SrcStride, u8* pu8Pred, l32 l32PredStride, s16* ps16Dct);

/*=============================================================================
º¯ Êı Ãû£º interpolate16x16_vc_c
¹¦    ÄÜ£º 16x16¿é°ëÏñËØ´¹Ö±ÃæºÍÖĞĞÄÃæ²åÖµ
Ëã·¨ÊµÏÖ£º ÎŞ
È«¾Ö±äÁ¿£º ÎŞ
²Î    Êı£º pu8Src           Ô´Í¼ÏñÖ¸Õë
           l32SrcStride     Ô´Í¼Ïñ¿í¶È
           pu8DstV          ´¹Ö±ÃæÍ¼ÏñÖ¸Õë
           pu8DstC          ÖĞĞÄÃæÍ¼ÏñÖ¸Õë
           l32DstStride     Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ£º ÎŞ 
=============================================================================*/
void Intp6TapHalfPelVC16x16_c(u8* pu8Src, l32 l32SrcStride, u8* pu8DstV, u8* pu8DstC, l32 l32DstStride);

void Intp6TapHalfPelALL16x16_c(u8 *pu8Src, u8 *pu8DstH, u8 *pu8DstV, u8 *pu8DstC, u16 u16Stride);
//predict

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Horz_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Horz_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Vert_c
¹¦    ÄÜ: Intra16x16ÁÁ¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Vert_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16Plane_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16Plane_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCLeft_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCLeft_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DCTop_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÁÁ¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DCTop_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict16x16DC128_c
¹¦    ÄÜ: Intra16x16ÁÁ¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict16x16DC128_c(u8* pu8Dst, l32 l32DstStride);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Horz_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈË®Æ½·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Horz_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Vert_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶È´¹Ö±·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Vert_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8Plane_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÆ½Ãæ·½Ê½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
          u8TopLeft       ×óÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8Plane_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top, u8* pu8Left, u8 u8TopLeft);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCLeft_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷×ó·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Left         ×ó·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCLeft_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Left);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DCTop_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷ÉÏ·½Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
          pu8Top          ÉÏ·½ÏñËØÉ«¶ÈÖµ
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DCTop_c(u8* pu8Dst, l32 l32DstStride, u8* pu8Top);

/*=============================================================================
º¯ Êı Ãû: H264IntraPredict8x8DC128_c
¹¦    ÄÜ: Ö¡ÄÚÉ«¶ÈÖ±Á÷128Ô¤²â
Ëã·¨ÊµÏÖ: ÎŞ
È«¾Ö±äÁ¿: ÎŞ
²Î    Êı: pu8Dst          Ä¿µÄÍ¼Ïñ
          l32DstStride    Ä¿µÄÍ¼Ïñ¿í¶È
·µ »Ø Öµ: ÎŞ 
=============================================================================*/
void H264IntraPredict8x8DC128_c(u8* pu8Dst, l32 l32DstStride);

l32 H264CoeffCost16_c(s16* ps16Coeff);

l32 H264CoeffCost15_c(s16* ps16Coeff);

void MemCopy16x16_c(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy16x8_c(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x16_c(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy8x8_c(const u8* pu8Src, l32 l32SrcStride, u8* pu8Dst, l32 l32DstStride);

void MemCopy_c(void* pDst, const void* pSrc, l32 l32Size);

void MemSet_c(void* pDst, const l32 l32Src, l32 l32Size);

u32 Deviation16x16_c(const u8* pu8Cur, l32 l32Stride);

l32 Clip3_c(l32 l32A, l32 l32Low, l32 l32High);

l32 GetMedian_c(l32 l32X, l32 l32Y, l32 l32Z);

u32 ArrayNonZeroCount4_c(s16* ps16V);

u32 ArrayNonZeroCount8_c(s16* ps16V);

u32 ArrayNonZeroCount16_c(s16* ps16V);

void ScanZigzag16x16_c(s16 ps16Zig[16][4 * 4], s16* ps16Dct);

void ScanZigzag8x8_c(s16* ps16Zig, s16* ps16Dct);

void ScanZigzag4x4_c(s16* ps16Zig, s16* ps16Dct);

void ScanZigzag2x2_c(s16* ps16Zig, s16* ps16Dct);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_01_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(aµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_01_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_03_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(cµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_03_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPelV4x4_10_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(dµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_10_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_11_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(eµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_11_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_12_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(fµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_12_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_13_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(gµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_13_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_21_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(iµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_21_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_23_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(kµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_23_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_30_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(nµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_30_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_31_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(pµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_31_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_32_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(qµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_32_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel4x4_33_c
¹¦ÄÜ         £º 4x4¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(rµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel4x4_33_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_01_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(aµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_01_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_03_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(cµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_03_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPelV8x8_10_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(dµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_10_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_11_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(eµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_11_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_12_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(fµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_12_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_13_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(gµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_13_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_21_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(iµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_21_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_23_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(kµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_23_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);


/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_30_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(nµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_30_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_31_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(pµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_31_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_32_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(qµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_32_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  IntpQuarterPel8x8_33_c
¹¦ÄÜ         £º 8x8¿éµÄËÄ·ÖÖ®Ò»ÏóËØ²åÖµ(rµã)
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void IntpQuarterPel8x8_33_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);


/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelH4x4_c
¹¦ÄÜ         £º 4x4¿éµÄË®Æ½·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelH4x4_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelV4x4_c
¹¦ÄÜ         £º 4x4¿éµÄ´¹Ö±·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelV4x4_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelHV4x4_c
¹¦ÄÜ         £º 4x4¿éµÄ¶Ô½Ç·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelHV4x4_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelH8x8_c
¹¦ÄÜ         £º 8x8¿éµÄË®Æ½·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelH8x8_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelV8x8_c
¹¦ÄÜ         £º 8x8¿éµÄ´¹Ö±·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16       *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelV8x8_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
º¯ÊıÃû       :  Intp6TapHalfPelHV8x8_c
¹¦ÄÜ         £º 8x8¿éµÄ¶Ô½Ç·½Ïò6Tap°ëÏóËØ²åÖµ
ÒıÓÃÈ«¾Ö±äÁ¿ £º ÎŞ
ÊäÈë²ÎÊıËµÃ÷ £º  const u8  *pu8Src        £ºÔ´¿éÖ¸Õë
                 u16        u16SrcStride  £ºÔ´¿é²½³¤
                 u8        *pu8Dst        £ºÄ¿±ê¿éÖ¸Õë
                 u16        u16DstStride  £ºÄ¿±ê¿é²½³¤
·µ»ØÖµËµÃ÷   £º ÎŞ
ÌØÊâËµÃ÷     £º ÎŞ
------------------------------------------------------------------------
ĞŞ¸Ä¼ÇÂ¼     :
ÈÕÆÚ£º      °æ±¾        ĞŞ¸ÄÈË      ĞŞ¸ÄÄÚÈİ

======================================================================*/
void Intp6TapHalfPelHV8x8_c(const u8 *pu8Src, u16 u16SrcStride, u8 *pu8Dst, u16 u16DstStride);

/*====================================================================
	º¯ÊıÃû	    :	H264ACDequant4x4_c
	¹¦ÄÜ		:	ÊµÏÖ 4x4 AC¿éµÄ·´Á¿»¯
	Ëã·¨ÊµÏÖ	:	(¿ÉÑ¡Ïî)
	ÒıÓÃÈ«¾Ö±äÁ¿:	ÎŞ
    ÊäÈë²ÎÊıËµÃ÷:	s16 *ps16InCoeff	:Òª·´Á¿»¯µÄÏµÊı¾ØÕó
					s16 *ps16OutCoeff	:Êä³ö½á¹û
					u32 u32Quant			:Á¿»¯ÏµÊı£¬
	·µ»ØÖµËµÃ÷  :	ÎŞ
====================================================================*/
void H264ACDequant4x4_c(s16 *ps16DCTIn, s16 *ps16DCTOut, u32 u32Quant);

void H264ACQuant4x4_c(s16 *ps16DCT, u8 u8Quant, l32 l32IsIntra);
/*====================================================================
	º¯ÊıÃû	    :	H264Dequant4x4_c
	¹¦ÄÜ		:	ÊµÏÖ 4x4 ¿éµÄ·´Á¿»¯
	Ëã·¨ÊµÏÖ	:	(¿ÉÑ¡Ïî)
	ÒıÓÃÈ«¾Ö±äÁ¿:	ÎŞ
    ÊäÈë²ÎÊıËµÃ÷:	s16 *ps16InCoeff	:Òª·´Á¿»¯µÄÏµÊı¾ØÕó£¬
					s16 *ps16OutCoeff	:Êä³ö½á¹û
					u8  u32Quant			:Á¿»¯ÏµÊı£¬
	·µ»ØÖµËµÃ÷  :	ÎŞ
====================================================================*/
void H264Dequant4x4_c(s16 *ps16DCTIn, s16 *ps16DCTOut, u32 u32Quant);

void H264Quant4x4_c(s16 *ps16DCT, u32 u32Quant, l32 l32IsIntra);


//4x4 1/4ÏñËØ²åÖµ
#define IntpQuarterPel4x4_01		IntpQuarterPel4x4_01_c
#define IntpQuarterPel4x4_03		IntpQuarterPel4x4_03_c
#define IntpQuarterPel4x4_10		IntpQuarterPel4x4_10_c
#define IntpQuarterPel4x4_11		IntpQuarterPel4x4_11_c
#define IntpQuarterPel4x4_12		IntpQuarterPel4x4_12_c
#define IntpQuarterPel4x4_13		IntpQuarterPel4x4_13_c
#define IntpQuarterPel4x4_21		IntpQuarterPel4x4_21_c
#define IntpQuarterPel4x4_23		IntpQuarterPel4x4_23_c
#define IntpQuarterPel4x4_30		IntpQuarterPel4x4_30_c
#define IntpQuarterPel4x4_31		IntpQuarterPel4x4_31_c
#define IntpQuarterPel4x4_32		IntpQuarterPel4x4_32_c
#define IntpQuarterPel4x4_33		IntpQuarterPel4x4_33_c

//4x4 6Tap °ëÏñËØ²åÖµ
#define Intp6TapHalfPelH4x4		    Intp6TapHalfPelH4x4_c
#define Intp6TapHalfPelV4x4		    Intp6TapHalfPelV4x4_c
#define Intp6TapHalfPelHV4x4		Intp6TapHalfPelHV4x4_c

//8x8 1/4ÏñËØ²åÖµ
#define IntpQuarterPel8x8_01		IntpQuarterPel8x8_01_c
#define IntpQuarterPel8x8_03		IntpQuarterPel8x8_03_c
#define IntpQuarterPel8x8_10		IntpQuarterPel8x8_10_c
#define IntpQuarterPel8x8_11		IntpQuarterPel8x8_11_c
#define IntpQuarterPel8x8_12		IntpQuarterPel8x8_12_c
#define IntpQuarterPel8x8_13		IntpQuarterPel8x8_13_c
#define IntpQuarterPel8x8_21		IntpQuarterPel8x8_21_c
#define IntpQuarterPel8x8_23		IntpQuarterPel8x8_23_c
#define IntpQuarterPel8x8_30		IntpQuarterPel8x8_30_c
#define IntpQuarterPel8x8_31		IntpQuarterPel8x8_31_c
#define IntpQuarterPel8x8_32		IntpQuarterPel8x8_32_c
#define IntpQuarterPel8x8_33		IntpQuarterPel8x8_33_c

//8x8 6Tap °ëÏñËØ²åÖµ
#define Intp6TapHalfPelH8x8		    Intp6TapHalfPelH8x8_c
#define Intp6TapHalfPelV8x8		    Intp6TapHalfPelV8x8_c
#define Intp6TapHalfPelHV8x8		Intp6TapHalfPelHV8x8_c

#define MemCopy16x16 MemCopy16x16_c

#define MemCopy16x8 MemCopy16x8_c

#define MemCopy8x16 MemCopy8x16_c

#define MemCopy8x8 MemCopy8x8_c

#define MemCopy MemCopy_c

#define MemSet MemSet_c

#define H264Deviation16x16 Deviation16x16_c

#define H264SAD16x8 SAD16x8_c

#define H264SAD8x16 SAD8x16_c

#define H264SAD SAD_c

#define H264SAD8x8 SAD8x8_c

#define H264SAD16x16 SAD16x16_c

#define H264SAD16x16Linar SAD16x16_c

#define PixelAverage16x16 PixAvg16x16_c

#define PixelAvgSad16x16 PixAvgSad16x16_c

#define PixelAverage PixAvg_c

#define EighthPelMCChroma8x8 McUVEighthPix8x8_c

#define EighthPelMCChroma8x4 McUVEighthPix8x4_c

#define EighthPelMCChroma4x8 McUVEighthPix4x8_c

#define EighthPelMCChroma4x4 McUVEighthPix4x4_c

#define H264DCT16x16 H264DCT16x16_c

#define H264DCT8x8 H264DCT8x8_c

#define H264DCT2x2DC            Hadamard2x2_c
#define H264Quant2x2DC          H264DCQuant2x2_c
#define H264iDCT2x2DC           IHadamard2x2_c
#define H264iQuant2x2DC         H264DCDequant2x2_c
#define H264DCT4x4DC            Hadamard4x4_c
#define H264iDCT4x4DC           IHadamard4x4_c
#define H264Quant4x4DC          H264DCQuant4x4_c
#define H264iQuant4x4DC         H264DCDequant4x4_c
#define H264ACDequant4x4        H264ACDequant4x4_c
#define H264ACQuant4x4          H264ACQuant4x4_c
#define H264Dequant4x4          H264Dequant4x4_c
#define H264Quant4x4            H264Quant4x4_c

#define H264AddiDCT16x16 H264AddiDCT16x16_c

#define H264AddiDCT8x8 H264AddiDCT8x8_c

#define H264AddiDCT4x4 H264AddiDCT4x4_c

#define H264Quant16x16 H264Quant16x16_c

#define H264Quant8x8 H264Quant8x8_c

#define H264iQuant16x16 H264Dequant16x16_c

#define H264iQuant8x8 H264Dequant8x8_c


#define H264SubDCTandQuant16x16 H264DctandQuant16x16_c

#define H264AddiDCTandiQuant16x16 H264AddiDCTiQuant16x16_c

#define H264AddiDCTadniQuant8x8 H264AddiDCTiQuant8x8_c

#define H264AddiDCTiQuant4x4 H264AddiDCTiQuant4x4_c

#define H264SubDCT8x8 H264SubDCT8x8_c

#define H264SubDCT16x16 H264SubDCT16x16_c

//encoder Intrapredict

#define H264IntraPredict16x16Horz H264IntraPredict16x16Horz_c

#define H264IntraPredict16x16Vert H264IntraPredict16x16Vert_c

#define H264IntraPredict16x16DC H264IntraPredict16x16DC_c

#define H264IntraPredict16x16Plane H264IntraPredict16x16Plane_c

#define H264IntraPredict16x16DCLeft H264IntraPredict16x16DCLeft_c

#define H264IntraPredict16x16DCTop H264IntraPredict16x16DCTop_c

#define H264IntraPredict16x16DC128 H264IntraPredict16x16DC128_c

#define H264IntraPredict8x8Horz H264IntraPredict8x8Horz_c

#define H264IntraPredict8x8Vert H264IntraPredict8x8Vert_c

#define H264IntraPredict8x8DC H264IntraPredict8x8DC_c

#define H264IntraPredict8x8Plane H264IntraPredict8x8Plane_c

#define H264IntraPredict8x8DCLeft H264IntraPredict8x8DCLeft_c

#define H264IntraPredict8x8DCTop H264IntraPredict8x8DCTop_c

#define H264IntraPredict8x8DC128 H264IntraPredict8x8DC128_c

#define HalfInterpolate16x16 Intp6TapHalfPelALL16x16_c

#define H264CoeffCost15 H264CoeffCost15_c

#define H264CoeffCost16 H264CoeffCost16_c

#define Clip3                   Clip3_c

#define GetMedian               GetMedian_c

#define ArrayNonZeroCount4      ArrayNonZeroCount4_c

#define ArrayNonZeroCount8      ArrayNonZeroCount8_c

#define ArrayNonZeroCount16     ArrayNonZeroCount16_c

#define ScanZigzag16x16         ScanZigzag16x16_c

#define ScanZigzag8x8           ScanZigzag8x8_c

#define ScanZigzag4x4           ScanZigzag4x4_c

#define ScanZigzag2x2           ScanZigzag2x2_c


#endif  /*xxx_CODE */

#if defined __cplusplus
}; /* End "C" */
#endif /* __cplusplus */

#endif // _H264F_LIB_H_
