/*****************************************************************************
   模块名      : Board Agent
   文件名      : mmpconfig.cpp
   相关文件    : 
   文件实现功能: 单板代理提供给上层应用的接口实现
   作者        : jianghy
   版本        : V0.9  Copyright(C) 2001-2002 KDC, All rights reserved.
-----------------------------------------------------------------------------
   修改记录:
   日  期      版本        修改人      修改内容
   2003/09/12  1.0         jianghy       创建
   2004/11/11  3.5         李 博         新接口的修改
******************************************************************************/
#include "osp.h"
#include "mmp_config.h"

/*
*构造函数
*/
CMmpConfig::CMmpConfig()
{
}
/*
*析构函数
*/
CMmpConfig::~CMmpConfig()
{
}

