/*=============================================================================
模   块   名: 网管公用模块库
文   件   名: calladdr.h
相 关  文 件: calladdr.cpp
文件实现功能: 呼叫终端地址的相关操作类
作        者: 李洪强
版        本: V4.0  Copyright(C) 2003-2006 KDC, All rights reserved.
说        明: 需要使用MFC
-------------------------------------------------------------------------------
修改记录:
日      期  版本    修改人      修改内容
2004/07/16  3.0     李洪强      创建
2005/12/08  4.0     王昊        分离出单独文件
=============================================================================*/

#ifndef _CALLADDR_20051208_H_
#define _CALLADDR_20051208_H_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include <afxcmn.h>
#include "kdvtype.h"

enum EmIpError{
// 正确
	emIpError_NoError,
// 0 不是一个有效项目。请指定一个介于 1 和 223 之间的数值。
// 0 is not a valid entry. Please specify a value between 1 and 223
	emIpError_ZeroIp,
// 以 127 起头的 IP 地址无效，因为它们保留用作环回地址。请在 1 和 223 之间指定一些其他有效值。
// IP address starting with 127 are not valid because they are reserved for loopback address. Please specify some other valid value between 1 and 223.
	emIpError_StartWith127,
// 无效 IP 地址和子网掩码合并。IP 地址的主机地址部分里所有字节都被设置为 1。请输入一个有效的 IP 地址和子网掩码合并。
// The combination of IP address and subnet mask is invalid. All of the bits in the host address portion of the IP address are set to 0. Please enter a valid combination of IP address and subnet mask.
	emIpError_InvalidSubnetMask

};
class CCallAddr
{
public:
    CCallAddr() {}
    ~CCallAddr() {}

    /*=============================================================================
    函 数 名:IsValidIpV4
    功    能:检验IP地址是否有效
    参    数:LPCTSTR lptrIPStr              [in]    字符串指针型的地址
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5     李洪强  加注释
    2005/08/31	4.0     刘瑞飞  根据王昊的算法修改
    =============================================================================*/
    static BOOL32 IsValidIpV4( LPCSTR lptrIPStr );

    /*=============================================================================
    函 数 名:IsValidIpV4
    功    能:IP控件中的地址是否有效
    参    数:CIPAddressCtrl *pcIpCtrl       [in]    IP控件的指针
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5     李洪强  加注释
    =============================================================================*/
    static BOOL32 IsValidIpV4(CIPAddressCtrl *pcIpCtrl);

    /*=============================================================================
    函 数 名:IsValidIpV4
    功    能:检验IP地址是否有效
    参    数:u32 dwIP                       [in]    u32型的地址, 主机序
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5     李洪强  加注释
    =============================================================================*/
    static BOOL32 IsValidIpV4(u32 dwIP);

    /*=============================================================================
    函 数 名:IsValidIpMask
    功    能:检验IP是否是合法的掩码
    参    数:LPCTSTR lptrIpMask             [in]    LPCTSTR型IP地址字符串
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/31  4.0     刘瑞飞  创建
    =============================================================================*/
    static BOOL32 IsValidIpMask( LPCSTR lptrIpMask );

    /*=============================================================================
    函 数 名:IsValidIpMask
    功    能:检验IP是否是合法的掩码
    参    数:CIPAddressCtrl *pcIpCtrl       [in]    IP控件指针
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/12/08  4.0     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidIpMask(CIPAddressCtrl *pcIpCtrl, BOOL32 bNeedFilter = FALSE);

    /*=============================================================================
    函 数 名:IsValidIpMask
    功    能:检验IP是否是合法的掩码
    参    数:u32 dwIpMask                   [in]    u32型IP地址, 主机序
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/31  4.0     刘瑞飞  创建
    =============================================================================*/
    static BOOL32 IsValidIpMask(u32 dwIpMask);

    /*=============================================================================
    函 数 名:IsValidE164
    功    能:检验E164号是否有效
    参    数:LPCTSTR lptrE164Str            [in]    LPCTSTR型E164号
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/05/26  3.6     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidE164(LPCSTR lptrE164Str);


    /*=============================================================================
    函 数 名:IsValidH320ID
    功    能:检验H320 ID是否有效
    参    数:LPCTSTR lptrH320ID             [in]    LPCTSTR型H320 ID
    注    意:无
    返 回 值:合法返回TRUE,非法返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/07/04  3.6     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidH320ID(LPCSTR lptrH320ID);

    /*=============================================================================
    函 数 名:GetIpStr
    功    能:得到IP地址的字串
    参    数:u32 dwIPAddr                   [in]    IP地址, 主机序
    注    意:无
    返 回 值:IP地址的字串
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5     李洪强  加注释
    2005/10/26  4.0     王昊    取消使用inet_ntoa
    =============================================================================*/
    static s8* GetIpStr(u32 dwIPAddr);

	/*=============================================================================
    函 数 名:GetCallStrType
    功    能:得到呼叫字符串类型
    参    数:const CString &csCallAddr      [in]    呼叫的字符串
    注    意:无
    返 回 值:呼叫类型           NORMAL_STR 一般字串
                                IP_STR      IP字串
                                NUM164_STR  E164号码
                                H323ID_STR  H323ID
                                H320ID_STR  H320ID
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5   李洪强  加注释
    2005/07/04  3.6   王昊    加入H320 ID
    =============================================================================*/
    static UINT GetCallStrType( LPCSTR csCallAddr);

    /*=============================================================================
    函 数 名:GetLocalIpAddr
    功    能:获取所有本机IP地址, 不包括127.0.0.1
    参    数:u32 *&pdwLocalIp               [out]   本机IP地址数组, 主机序
             s32 &nIpNum                    [out]   数组个数
    注    意:本函数会分配pdwLocalIp空间, 请在调用完毕delete 分配的空间
             调用举例:
                 u32 *pdwLocalIp = NULL;
                 s32 nIpNum = 0;
                 CCallAddr::GetLocalIpAddr( pdwLocalIp, nIpNum );
                 DEL_PTR_ARRAY( pdwLocalIp );

             返回的IP为主机序
    返 回 值:是否获取成功
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/10/29  4.0   王昊    创建
    2007/05/09  4.0   王廖荣  修改
    =============================================================================*/
    static BOOL32 GetLocalIpAddr(u32 *&pdwLocalIp, s32 &nIpNum);

    /*=============================================================================
    函 数 名:GetLastErrorInfo
    功    能:得到错误的原因
    参    数:CString &csErrorInfo           [out]   错误的描述
    注    意:中文字符串, 不考虑双语
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2004/09/13  3.5   李洪强  加注释
    =============================================================================*/
//    static void GetLastErrorInfo(CString &csErrorInfo);

	/*=============================================================================
	函 数 名: IsValidCallIP
	功    能: 判断IP地址是否为合法呼叫IP
	参    数: u32 dwIP                          [in]    主机序IP地址
	注    意: 输入IP地址必须为IsValidIpV4判断出来的合法地址，
			  在GetCallStrType之后使用
	返 回 值: emIpError
	-------------------------------------------------------------------------------
	修改纪录:
	日      期  版本    修改人  修改内容
	2013/07/17  1.0    邹俊龙    创建
	=============================================================================*/
	static BOOL32 IsValidCallIP( u32 dwIP, EmIpError* emIpError = NULL );

    /*=============================================================================
    函 数 名: IsValidCallIP
    功    能: 判断IP地址是否为合法呼叫IP
    参    数: u32 dwIP                          [in]    主机序IP地址
              CString &cstrErrStr               [out]   错误描述字符串
              u8 byLanType                      [in]    错误描述语言类型(0: 简体中文; 1: 英文)
    注    意: 输入IP地址必须为IsValidIpV4判断出来的合法地址，
              在GetCallStrType之后使用
    返 回 值: BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2007/04/25  1.0     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidCallIP(u32 dwIP, const s8* cstrErrStr,
                                u8 byLanType);

    /*=============================================================================
    函 数 名: IsValidMulticastIP
    功    能: 判断IP地址是否为合法组播IP
    参    数: u32 dwIP                          [in]    主机序IP地址
    注    意: 输入IP地址必须为IsValidIpV4判断出来的合法地址
    返 回 值: BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2007/04/25  1.0     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidMulticastIP(u32 dwIP);

    /*=============================================================================
    函 数 名: IsValidDevIP
    功    能: 判断IP地址是否为合法设备IP(检验设备配置IP地址)
    参    数: u32 dwIP                          [in]    主机序设备IP地址
              u32 dwMask                        [in]    主机序掩码
              CString &cstrErrStr               [out]   错误描述字符串
              u8 byLanType                      [in]    错误描述语言类型(0: 简体中文; 1: 英文)
    注    意: 设备IP地址必须为IsValidIpV4判断出来的合法地址，
              掩码必须为IsValidIpMask判断出来的合法掩码
    返 回 值: BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2007/04/25  1.0     王昊    创建
    =============================================================================*/
    static BOOL32 IsValidDevIP(u32 dwIP, u32 dwMask, const s8* cstrErrStr,
                               u8 byLanType);


	#define MAX_IP_LEN 16
	// 从一个字符串里面获取pu的ip和别名
	static BOOL32 GetPuInfo( const s8* strAlis, u32& dwIP, s8* strName );
	static BOOL32 GetPuInfo( const s8* strAlis, s8* strIP, s8* strName );
	// 通过ip和别名设置一个pu名字
	static BOOL32 SetPuInfo( s8* strName, const u32 dwIP, const s8* strAlis );
	
	static BOOL32 SetPuInfo( s8* strName, const s8* strIP, const s8* strAlis );
public:
//    enum {
//        VALID_IPADDR = 0,
//        ERROR_INPUTNULL,
//        ERROR_LEN,
//        ERROR_ZERO_BEGIN,
//        ERROR_POINTSTART_OR_NOPONIT,
//        ERROR_NOT_NUM_OR_POINT,
//        ERROR_POINT_POS,
//        ERROR_EXTRA_POINT,
//        ERROR_VALUE
//    };
    enum {
        NORMAL_STR = 0,
        IP_STR,
        NUM164_STR,
        H323ID_STR,
        H320ID_STR
    };
private:
//    static u32 s_dwError;
    static s8 s_cstrIpStr[MAX_IP_LEN];
};

#endif  //  _CALLADDR_20051208_H_