/*****************************************************************************
模块名      : GkcTestQuery
文件名      : GkcTestQuery.h
相关文件    : GkcTestQuery.cpp
              
文件实现功能: 定义Gkc测试查询库的接口类，提供接口给单元测试和集成测试使用
作者        : 陈洪斌
模块版本    : V4.0  Copyright(C) 2002-2005 KDC, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期(n/m/d)      文件版本        修改人      修改内容
2005/08/10         0.1            陈洪斌      创建
******************************************************************************/
#if !defined(AFX_GKCTESTQUERY_H__12F6BB66_494E_48C8_A767_39859690D2F2__INCLUDED_)
#define AFX_GKCTESTQUERY_H__12F6BB66_494E_48C8_A767_39859690D2F2__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "kdvgk.h"
#include "GkcStructDefine.h"
class CGkcTestQuery  
{
public:
	CGkcTestQuery();
	virtual ~CGkcTestQuery();
public:
//////////////////////////////////////////////////////////////////////////
// 查询库建链和断链接口
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : ConnectToGKConsole
    功能        : 请求与GK控制台建链
    输入参数说明: dwIPAddr :GK控制台IP地址
                  wListenPort: GK控制台侦听端口
    返回值说明  : TRUE  建链成功
                  FALSE 建链失败
    ====================================================================*/
    BOOL ConnectToGKConsole( DWORD dwIPAddr = inet_addr("127.0.0.1") ,
                             WORD wListenPort = 2222 );

    /*====================================================================
    函数名      : DisConnectFromGKConsole
    功能        : 请求与GK控制台断链
    输入参数说明: 无
    返回值说明  : TRUE  断链成功
                  FALSE 断链失败
    ====================================================================*/
    BOOL DisConnectFromGKConsole();

//////////////////////////////////////////////////////////////////////////
// 运行时查询接口
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : GetRegEndpointCount
    功能        : 获取已注册实体数量
    输入参数说明: nCount  存储取到实体的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetRegEndpointCount(int& nCount);

    
    /*====================================================================
    函数名      : GetRegEndpointItem
    功能        : 获取某项已注册实体的全部信息
    输入参数说明: nItem  要获取的项
                  tHeadInfo 保存某项已注册实体的头信息
                  ptAliasInfo 保存某项已注册实体的别名信息，传入数组的头指针
                  nAliasCount 指定传入别名数组的大小
                  ptCallAddrInfo 保存某项已注册实体的呼叫地址信息，传入数组的头指针
                  nCallAddrCount 指定传入地址信息数组的大小
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetRegEndpointItem(int nItem,
                            TGKCtrlBufBodyHead& tHeadInfo,
                            TAliasAddr* ptAliasInfo,
                            int nAliasCount,
                            TNETADDR* ptCallAddrInfo,
                            int nCallAddrCount);

    /*====================================================================
    函数名      : GetRegEndpointHead
    功能        : 获取某项已注册实体的头信息
    输入参数说明: nItem  要获取的项
                  tHeadInfo 保存某项已注册实体的头信息
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetRegEndpointHead(int nItem,TGKCtrlBufBodyHead& tHeadInfo);

    /*====================================================================
    函数名      : GetRegEndpointAlias
    功能        : 获取某项已注册实体的别名信息
    输入参数说明: nItem  要获取的项
                  ptAliasInfo 保存某项已注册实体的别名信息，传入数组的头指针
                  nAliasCount 别名数组的大小（获取头信息时能取到）
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetRegEndpointAlias(int nItem,TAliasAddr* ptAliasInfo, int nAliasCount);


    /*====================================================================
    函数名      : GetRegEndpointCallAddr
    功能        : 获取某项已注册实体的呼叫地址信息
    输入参数说明: nItem  要获取的项
                  ptCallAddrInfo 保存某项已注册实体的呼叫地址信息，传入数组的头指针
                  nAddrCount 呼叫地址信息个数（获取头信息时能取到）
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetRegEndpointCallAddr(int nItem,TNETADDR* ptCallAddrInfo, int nAddrCount);


    /*====================================================================
    函数名      : GetCallCount
    功能        : 获取实体呼叫的数量
    输入参数说明: nCount  存储取到实体呼叫的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetCallCount(int& nCount);

    /*====================================================================
    函数名      : GetCallItem
    功能        : 获取某项实体呼叫的具体信息
    输入参数说明: nItem   要获取的项
                  tCall   保存某项实体呼叫的具体信息
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetCallItem(int nItem,TCallIdDBData& tCall);

    /*====================================================================
    函数名      : IsRegEndpointExist
    功能        : 判断某个已注册实体是否存在
    输入参数说明: TAliasAddr  已注册实体的别名信息
    返回值说明  : TRUE  实体存在
                  FALSE 实体不存在
    ====================================================================*/
    BOOL IsRegEndpointExist(CString& strH323Alias);

    /*====================================================================
    函数名      : IsRegEndpointExist
    功能        : 判断某个实体呼叫是否存在
    输入参数说明: strSrcAlias: 主叫别名
                  strDstAlias: 被叫别名
    返回值说明  : TRUE  实体存在
                  FALSE 实体不存在
    ====================================================================*/
    BOOL IsCallExist(CString& strSrcAlias, CString& strDstAlias);

//////////////////////////////////////////////////////////////////////////
// 配置查询接口 -- 基本配置
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : GetPrefixCount
    功能        : 获取前缀（区号）数量
    输入参数说明: nCount  存储取到前缀（区号）的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetPrefixCount(int& nCount);

    /*====================================================================
    函数名      : GetPrefixItem
    功能        : 获取某项前缀（区号）的具体信息
    输入参数说明: nItem       要获取的项
                  tGkPrefix   保存某项前缀（区号)
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetPrefixItem(int nItem,TGKPrefix& tGkPrefix);

    /*====================================================================
    函数名      : GetNeighborGkCount
    功能        : 获取临近GK服务器数量
    输入参数说明: nCount  存储临近GK服务器的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetNeighborGkCount(int& nCount);

    /*====================================================================
    函数名      : GetNeighborGkItem
    功能        : 获取某项临近GK服务器的具体信息
    输入参数说明: nItem : 要获取的项
                  tNeighborGkInfo : 保存某项临近GK服务器信息
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetNeighborGkItem(int nItem,TNeighborGKInfo& tNeighborGkInfo);
    
    /*====================================================================
    函数名      : GetAuthMethod
    功能        : 获取GK注册认证策略
    输入参数说明: cAuthMethod: 认证策略信息
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetAuthMethod(CGkAuthMothod& cAuthMethod);
    
    /*====================================================================
    函数名      : IsPrefixExist
    功能        : 检查某个前缀（区号）是否存在
    输入参数说明: tGkPrefix  前缀（区号）信息
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsPrefixExist(TGKPrefix& tGkPrefix);
    
    /*====================================================================
    函数名      : IsNeighborGk
    功能        : 检查临近GK服务器是否存在
    输入参数说明: tNeighborGkInfo  临近GK服务器信息
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsNeighborGkExist(TNeighborGKInfo& tNeighborGkInfo);

    /*====================================================================
    函数名      : IsAuthMethodMatch
    功能        : 检查GK注册认证策略是否匹配
    输入参数说明: cAuthMethod  认证策略信息
    返回值说明  : TRUE  匹配
                  FALSE 不匹配
    ====================================================================*/
    BOOL IsAuthMethodMatch(CGkAuthMothod& cAuthMethod);

//////////////////////////////////////////////////////////////////////////
// 配置查询接口 -- 网段带宽
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : GetBandwidthCount
    功能        : 获取网段带宽数量
    输入参数说明: nCount  存储取到网段带宽的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetBandwidthCount(int& nCount);

    /*====================================================================
    函数名      : GetBandwidthItem
    功能        : 获取某项网段带宽的具体信息
    输入参数说明: nItem  要获取的项
                  tCfgBandwidth 网段间带宽信息
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetBandwidthItem(int nItem, TConfigBandWidthDBData& tCfgBandwidth);

    /*====================================================================
    函数名      : IsBandwidthExist
    功能        : 检查某个网段带宽是否存在
    输入参数说明: tCfgBandwidth 网段间带宽信息
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsBandwidthExist(TConfigBandWidthDBData& tCfgBandwidth);
    
//////////////////////////////////////////////////////////////////////////
// 配置查询接口 -- 认证Ip范围
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : GetIpRangeCount
    功能        : 获取认证Ip范围数量
    输入参数说明: nCount  存储取到禁止/允许Ip的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetIpRangeCount(int& nCount);

    /*====================================================================
    函数名      : GetIpRangeItem
    功能        : 获取某项认证Ip范围信息
    输入参数说明: nItem   要获取的项
                  tCfgIpRange 保存认证Ip范围信息 
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetIpRangeItem(int nItem, TConfigAuthIPDBData& tCfgIpRange);
    
    /*====================================================================
    函数名      : IsIpRangeExist
    功能        : 检查某个认证Ip范围是否存在
    输入参数说明: tCfgIpRange 认证Ip范围信息 
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsIpRangeExist(TConfigAuthIPDBData& tCfgIpRange);

//////////////////////////////////////////////////////////////////////////
// 配置查询接口 -- 认证实体
//////////////////////////////////////////////////////////////////////////    
    /*====================================================================
    函数名      : GetEndpointCount
    功能        : 获取认证实体别名数量
    输入参数说明: nCount  存储取到认证实体别名的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetEndpointAliasCount(int& nCount);

    /*====================================================================
    函数名      : GetEndpointItem
    功能        : 获取某项认证实体别名具体信息
    输入参数说明: nItem  要获取的项
                  tCfgEndpoint 保存取得的认证实体别名信息                                                 
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetEndpointAliasItem(int nItem, TConfigAliasAuthDBData& tCfgEndpoint);

    /*====================================================================
    函数名      : IsEndpointExist
    功能        : 检查某个认证实体别名是否存在
    输入参数说明: tCfgEndpoint 认证实体别名信息 
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsEndpointAliasExist(TConfigAliasAuthDBData& tCfgEndpointAlias);

//////////////////////////////////////////////////////////////////////////
// 用户管理查询接口
//////////////////////////////////////////////////////////////////////////      
    /*====================================================================
    函数名      : GetUserCount
    功能        : 获取用户数量
    输入参数说明: nCount  存储取到用户的数量
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetUserCount(int& nCount);

    /*====================================================================
    函数名      : GetUserItem
    功能        : 获取某项用户具体信息
    输入参数说明: nItem  要获取的项
                  tUser  保存某项用户具体信息                                                      
    返回值说明  : TRUE  获取成功
                  FALSE 获取失败
    ====================================================================*/
    BOOL GetUserItem(int nItem, TCtrlUserDBData& tUser);

    /*====================================================================
    函数名      : IsUserExist
    功能        : 检查某个用户是否存在,仅验证用户名称(仅管理员用户登录有效)
    输入参数说明: strUserName 用户名称 
    返回值说明  : TRUE  存在
                  FALSE 不存在
    ====================================================================*/
    BOOL IsUserExist(const CString& strUserName);   

    /*====================================================================
    函数名      : IsUserMatch
    功能        : 检查某个用户信息是否匹配,需要验证用户名称和密码
                  (仅管理员用户登录有效)
    输入参数说明: tUser 用户信息 
    返回值说明  : TRUE  匹配
                  FALSE 不匹配
    ====================================================================*/
    BOOL IsUserMatch(TCtrlUserDBData& tUser);
//////////////////////////////////////////////////////////////////////////
// 其他查询接口
//////////////////////////////////////////////////////////////////////////      
    /*====================================================================
    函数名      : IsGkcLonIn
    功能        : 检查是否有用户登录Gkc
    输入参数说明: 无
    返回值说明  : TRUE  登陆了Gkc
                  FALSE 没有用户登录或Osp消息发送失败
    ====================================================================*/
    BOOL IsGkcLonIn();

    /*====================================================================
    函数名      : GetCurLogInUser
    功能        : 获取当前登录的用户名称和密码
    输入参数说明: strUserName 保存当前登录用户的名称
                  strUserPwd 保存当前登录用户的密码 
    返回值说明  : TRUE  登陆了Gkc
                  FALSE 没有用户登录或Osp消息发送失败
    ====================================================================*/
    BOOL GetCurLogInUser(CString& strUserName,CString& strUserPwd);

private:
    DWORD m_dwNodeId; //Gkc控制台查询测试Osp实例节点
};

#endif // !defined(AFX_GKCTESTQUERY_H__12F6BB66_494E_48C8_A767_39859690D2F2__INCLUDED_)
