/*=============================================================================
模   块   名: 会议控制台业务功能库集成测试库
文   件   名: mcslibitest.h
相 关  文 件: mcslibitest.cpp
文件实现功能: 查询功能
作        者: 王昊
版        本: V4.0  Copyright(C) 2003-2005 KDC, All rights reserved.
-------------------------------------------------------------------------------
修改记录:
日      期  版本    修改人      修改内容
2005/07/05  4.0     王昊        创建
=============================================================================*/

#ifndef _MCSLIBITEST_20050705_H_
#define _MCSLIBITEST_20050705_H_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "mcsstruct.h"

class CIMcsTest
{
public:
    /*=============================================================================
    函 数 名:CIMcsTest
    功    能:构造函数
    参    数:BOOL32 bCreateApp                  [in]    是否创建应用
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    CIMcsTest();

    /*=============================================================================
    函 数 名:~CIMcsTest
    功    能:析构函数
    参    数:无
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual ~CIMcsTest();

    ///////////////////////////////////////////////////////////////////////////
    // 初始化和结束操作
    ///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:ConnectLib
    功    能:建立与MCSLIB库的连接
    参    数:LPCTSTR pszLibIP               [in]    MCSLIB库的IP地址
             u16 wPort                      [in]    连接的端口号
    注    意:无
    返 回 值:成功       MCSLIB_OK
	         失败       MCSLIB_INVALID_PARAM        传入的参数当中有无效值
	                    MCSLIB_CONNECT_MCU          连接Lib失败
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual u16 ConnectLib(LPCTSTR pszLibIP, u16 wPort);

    /*=============================================================================
    函 数 名:DisConnectLib
    功    能:断开与MCSLIB库的连接
    参    数:无
    注    意:无
    返 回 值:成功       MCSLIB_OK
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual u16 DisConnectLib(void);

private:
    ///////////////////////////////////////////////////////////////////////////
	// 消息发送和接收
	///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:SendQueryMsg
    功    能:发送查询消息，并从测试库得到相应的信息
    参    数:CMsgHeadInfo &cMsgHeadInfo         [in]    消息头
             u8 * const pbyAckBuf               [out]   从库里返回的需要的空间
             u16 wAckBufLen                     [in]    接收的空间的大小
             u16 &wRealAckLen                   [out]   实际返回的空间的大小
             u8 * const pbyMsgBody              [in]    发送的消息体
             u16 wMsgBodyLen                    [in]    发送的消息体的长度
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    BOOL32 SendQueryMsg(CMsgHeadInfo &cMsgHeadInfo, u8 * const pbyAckBuf,
                        u16 wAckBufLen, u16 &wRealAckLen,
                        u8 * const pbyMsgBody, u16 wMsgBodyLen);

    /*=============================================================================
    函 数 名:WaitToQuery
    功    能:等待并定时向库来查询
    参    数:CMsgHeadInfo &cMsgHeadInfo         [in]    消息头
             u8 * const pbyAckBuf               [out]   要返回的空间
             u16 wAckBufLen                     [in]    接收的空间的大小
             u16 &wRealAckLen                   [out]   实际返回的空间的大小
             u8 * const pbyMsgBody              [in]    传入的消息体
             u16 wMsgBodyLen                    [in]    传入的消息体的长度
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    BOOL32 WaitToQuery(CMsgHeadInfo &cMsgHeadInfo, u8 * const pbyAckBuf,
                       u16 wAckBufLen, u16 &wRealAckLen,
                       u8 * const pbyMsgBody = NULL, u16 wMsgBodyLen = 0);

public:
    /*=============================================================================
    函 数 名:SetQueryMcu
    功    能:设置查询MCU
    参    数:u32 dwMcuIpAddr                    [in]    查询MCU的IP地址
    注    意:发送: 无       返回: u32
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 SetQueryMcu(u32 dwMcuIpAddr);

    ///////////////////////////////////////////////////////////////////////////
	// 查询地址簿信息
	///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:GetAddrEntryNum
    功    能:得到地址簿条目使用个数
    参    数:u32 * const pdwNum                 [out]   条目使用个数
    注    意:发送: 无       返回: u32
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetAddrEntryNum(u32 * const pdwNum);

    /*=============================================================================
    函 数 名:GetAddrGroupNum
    功    能:得到地址簿会议组使用个数
    参    数:u32 * const pdwNum                 [out]   会议组使用个数
    注    意:发送: 无       返回: u32
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetAddrGroupNum(u32 * const pdwNum);

    /*=============================================================================
    函 数 名:GetAddrEntry
    功    能:得到当前所有地址簿条目
    参    数:CAddrEntry * const pcAddrEntry     [out]   地址簿条目
             u32 &dwEntryNum                    [out]    条目个数
    注    意:发送: u32(已接收个数)
             返回: u32(总个数) + u32(已发送个数) + u32(这次发送个数) + n * TMcuAddrEntry
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetAddrEntry(TMcuAddrEntry * const ptAddrEntry, u32 &dwEntryNum);

    /*=============================================================================
    函 数 名:GetAddrGroupEntry
    功    能:得到当前所有会议组条目
    参    数:CAddrMultiSetEntry * const pcAddrGroupEntry    [out]   地址簿会议组条目
             u32 &dwEntryNum                    [out]   会议组个数
    注    意:发送: u32(已接收个数)
             返回: u32(总个数) + u32(已发送个数) + u32(这次发送个数)
                    + n * TMcuAddrGroup
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetAddrGroupEntry(TMcuAddrGroup * const ptAddrGroup,
                                     u32 &dwEntryNum);

    /*=============================================================================
    函 数 名:IsEntryExist
    功    能:地址簿条目是否存在
    参    数:const TMcuAddrEntry &tInfo            [in]    地址簿条目
    注    意:发送: TMcuAddrEntry       返回: BOOL
    返 回 值:存在返回TRUE，判断失败或不存在返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 IsEntryExist(const TMcuAddrEntry &tEntry);

    /*=============================================================================
    函 数 名:IsGroupExist
    功    能:地址簿会议组是否存在
    参    数:const TMcuAddrGroup &tInfo        [in]    会议组
    注    意:发送: TMcuAddrGroup 返回: BOOL
    返 回 值:存在返回TRUE，判断失败或不存在返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 IsGroupExist(const TMcuAddrGroup &tGroup);

    /*=============================================================================
    函 数 名:IsEntryInGroup
    功    能:地址簿条目是否存在于会议组中
    参    数:const TMcuAddrEntry &tEntryInfo       [in]    条目
             const TMcuAddrGroup &tGroupInfo       [in]    会议组
    注    意:发送: TMcuAddrEntry + TMcuAddrGroup  返回: BOOL
    返 回 值:存在返回TRUE，判断失败或不存在返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 IsEntryInGroup(const TMcuAddrEntry &tEntryInfo,
                                  const TMcuAddrGroup &tGroupInfo);

    ///////////////////////////////////////////////////////////////////////////
	// 查询用户管理信息
	///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:GetUserNum
    功    能:获取用户个数
    参    数:u32 &dwUserNum                     [out]   用户个数
    注    意:发送: 无  返回: u32
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetUserNum(u32 &dwUserNum);

    /*=============================================================================
    函 数 名:GetUserTable
    功    能:得到当前所有用户的信息
    参    数:CUserTable &cUserTable             [out]   当前所有用户的信息
    注    意:发送: 无  返回: u32(总个数) + n * CUserFullInfo
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetUserTable(CUserTable &cUserTable);

    /*=============================================================================
    函 数 名:IsUserExist
    功    能:指定用户在用户列表中是否存在
    参    数:LPCTSTR pszUserName                [in]    指定用户
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 IsUserExist(LPCTSTR pszUserName);

    /*=============================================================================
    函 数 名:GetUser
    功    能:获取指定用户
    参    数:LPCTSTR pszUserName                [in]    指定用户
             CUserFullInfo &cUserInfo           [out]   用户信息
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetUser(LPCTSTR pszUserName, CUserFullInfo &cUserInfo);

    ///////////////////////////////////////////////////////////////////////////
	// 查询会议信息
	///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:GetConfTable
    功    能:查询会议列表
    参    数:CConfTable * const pcConfTable         [out]   会议列表
    注    意:无
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetConfTable(CConfTable * const pcConfTable);

    /*=============================================================================
    函 数 名:GetConf
    功    能:获取会议
    参    数:const CConfId &cConfId                 [in]    会议号
             CConf &cConf                           [out]   会议
    注    意:无
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetConf(const CConfId &cConfId, CConf &cConf);

    /*=============================================================================
    函 数 名:GetConfInfo
    功    能:获取TConfInfo
    参    数:const CConfId &cConfId                 [in]    会议号
             TConfInfo * const ptConfInfo           [out]   会议信息
    注    意:发送: CConfId  返回: TConfInfo
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetConfInfo(const CConfId &cConfId,
                               TConfInfo * const ptConfInfo);

    /*=============================================================================
    函 数 名:GetConfAllMtInfo
    功    能:获取TConfAllMtInfo
    参    数:const CConfId &cConfId                 [in]    会议号
             TConfAllMtInfo * const ptAllMtInfo     [out]   会议所有终端信息
    注    意:发送: CConfId  返回: TConfAllMtInfo
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetConfAllMtInfo(const CConfId &cConfId,
                                    TConfAllMtInfo * const ptAllMtInfo);

    /*=============================================================================
    函 数 名:GetMcuTable
    功    能:获取会议所有MCU信息列表
    参    数:const CConfId &cConfId                 [in]    会议号
             CMcuTable &cMcuTable                   [out]   会议所有MCU信息列表
    注    意:无
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetMcuTable(const CConfId &cConfId, CMcuTable &cMcuTable);

    /*=============================================================================
    函 数 名:GetSingleMcuInfo
    功    能:获取会议单级MCU信息
    参    数:const CConfId &cConfId                 [in]    会议号
             const TMcu &tMcu                       [in]    MCU
             CSingleMcuInfo &cSingleMcuInfo         [out]   单级MCU信息
    注    意:无
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetSingleMcuInfo(const CConfId &cConfId, const TMcu &tMcu,
                                    CSingleMcuInfo &cSingleMcuInfo);

    /*=============================================================================
    函 数 名:GetMt
    功    能:获取会议终端
    参    数:const CConfId &cConfId                 [in]    会议号
             const TMt &tMt                         [in]    要获取的终端
             CMt &cMt                               [out]   输出终端
    注    意:发送: CConfId + TMt        返回: CMt
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
	virtual BOOL32 GetMt(const CConfId &cConfId, const TMt &tMt, CMt &cMt);

    /*=============================================================================
    函 数 名:ConfGetName
    功    能:获取会议名
    参    数:const CConfId &cConfId                 [in]    会议号
             LPTSTR pszConfName                     [out]   会议名
    注    意:无
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 ConfGetName(const CConfId &cConfId, LPTSTR pszConfName);

    /*=============================================================================
    函 数 名:GetMonitorParam
    功    能:获取监控参数
    参    数:u8 byIndex                             [in]    监控通道号
             TMonitorParam &tMonitorParam           [out]   监控参数
    注    意:发送: u8(通道号)         返回: TMonitorParam
    返 回 值:成功返回TRUE,失败返回FALSE
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetMonitorParam(u8 byIndex, TMonitorParam &tMonitorParam);

    ///////////////////////////////////////////////////////////////////////////
    // 查询外设信息
    ///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:GetPeriTable
    功    能:得到当前所有外设的信息
    参    数:CPeriTable &cPeriTable             [out]   当前所有外设的信息
    注    意:发送: u32(已接受个数)
             返回: u32(总个数) + u32(已发送个数) + u32(这次发送个数)
                    + n * ( TPeriEqpStatus + u32(IP) )
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetPeriTable(CPeriTable &cPeriTable);

    /*=============================================================================
    函 数 名:GetPeriStatus
    功    能:获取指定外设信息
    参    数:const TEqp &tEqp                   [in]    指定外设
             TPeriEqpStatus &tPeriStatus        [out]   外设信息
    注    意:发送: TEqp     返回: TPeriEqpStatus
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetPeriStatus(const TEqp &tEqp, TPeriEqpStatus &tPeriStatus );

    ///////////////////////////////////////////////////////////////////////////
    // 查询MCU信息
    ///////////////////////////////////////////////////////////////////////////
    /*=============================================================================
    函 数 名:IsUserLogon
    功    能:当前是否有用户登录
    参    数:无
    注    意:发送: 无       返回: BOOL
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 IsUserLogon(void);

    /*=============================================================================
    函 数 名:GetConnectedMcu
    功    能:获取当前连接的MCU
    参    数:TMcuExt &tMcuExt                   [out]   当前连接的MCU
    注    意:发送: 无       返回: CMcu
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/15  4.0     王昊    创建
    =============================================================================*/
    virtual BOOL32 GetConnectedMcu(TMcuExt &tMcuExt);

private:
    u16 m_wInsId;       //  Osp连接的实例号
    u32 m_dwLibNode;    //  mcslib节点
};

#endif  //  _MCSLIBITEST_20050705_H_